{"posts":[{"id":382,"t":"SuperRare Improvement Proposal Procedures v0","d":"2021-12-23T21:12:43.018Z","c":"<h1><a name=\"the-superrare-improvement-proposal-procedures-v0-1\" class=\"anchor\" href=\"#the-superrare-improvement-proposal-procedures-v0-1\"></a>The SuperRare Improvement Proposal Procedures v0</h1>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Author</strong></td>\n<td>John Crain</td>\n</tr>\n<tr>\n<td><strong>Status</strong></td>\n<td>Consensus</td>\n</tr>\n<tr>\n<td><strong>Type</strong></td>\n<td>Governance</td>\n</tr>\n<tr>\n<td><strong>Implementor</strong></td>\n<td>N/A</td>\n</tr>\n<tr>\n<td><strong>Sponsor(s)</strong></td>\n<td><a href=\"https://twitter.com/Sim_Pop\" rel=\"noopener nofollow ugc\">Sim_Pop</a>, <a href=\"https://twitter.com/SerenaTabacchi\" rel=\"noopener nofollow ugc\">SerenaTabacchi</a>, <a href=\"https://twitter.com/Cooopahtroopa\" rel=\"noopener nofollow ugc\">Cooopahtroopa</a>, <a href=\"https://twitter.com/derekedws\" rel=\"noopener nofollow ugc\">derekedws</a>, <a href=\"https://twitter.com/NTmoney\" rel=\"noopener nofollow ugc\">NTmoney</a>, <a href=\"https://twitter.com/VanArman\" rel=\"noopener nofollow ugc\">VanArman</a></td>\n</tr>\n<tr>\n<td><strong>Temperature Check Poll</strong></td>\n<td><a href=\"https://discord.com/channels/666318003972997136/868174870389878865/923685543605325844\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Discord</a></td>\n</tr>\n<tr>\n<td><strong>Created Date</strong></td>\n<td>12/23/2021</td>\n</tr>\n</tbody>\n</table>\n</div><blockquote>\n<p>This proposal offers a minimum “SuperRare Improvement Proposal” framework to enable community governance over decisions affecting the SuperRare DAO. This updated framework empowers the SuperRare community to make changes to the network in a transparent and efficient manner.</p>\n</blockquote>\n<h1><a name=\"background-2\" class=\"anchor\" href=\"#background-2\"></a>Background</h1>\n<hr>\n<p><strong>What are the SIP Procedures?</strong> These SIP Procedures are the official mechanism to create community discourse and steer Council decision making regarding the SuperRare DAO.</p>\n<hr>\n<p><strong>What is a SIP?</strong> A SuperRare Improvement Proposal (“SIP”) is a document describing a potential improvement to SuperRare for the network’s consideration.</p>\n<hr>\n<p><strong>What Can Be Proposed in a SIP?</strong> There is theoretically no limit to a SIP, but here are some examples:</p>\n<ul>\n<li>A proposal to establish incentives using tokens from the SuperRare DAO Treasury.</li>\n<li>A proposal to change a curation parameter or governance method.</li>\n<li>A proposal to hire services providers to help develop, decentralize, or otherwise enhance the SuperRare DAO.</li>\n<li>A proposal to change the number of Spaces that can be whitelisted in each Space Race</li>\n<li>A proposal to add, remove or replace one or more Council member(s) or SuperRare Space(s)</li>\n</ul>\n<p><strong>How Does a SIP go up for a $RARE Token Holder Vote?</strong> All proposals that follow the SIP Procedures, have high engagement, and that receive a formal endorsement from at least one Council member are eligible to be voted in and implemented through $RARE governance.</p>\n<h1><a name=\"the-sip-procedures-3\" class=\"anchor\" href=\"#the-sip-procedures-3\"></a>The SIP Procedures</h1>\n<p>The proposed SIP Procedures follow a <code>four-stage</code> workflow to ensure that high quality proposals with significant support are heard and implemented. This system is designed to strike an effective balance between pure community self-governance and transparent, decisive Council decision making.</p>\n<ul>\n<li>\n<p><strong>I. Temperature Check</strong></p>\n<p>Before a proposal can be voted on, it must survive a community “Temperature Check.” Soft signalling methods are deployed within governance forums to discover the highest quality proposals with the most community support.</p>\n<p><img src=\"https://forum.rare.xyz/images/emoji/twitter/thermometer.png?v=12\" title=\":thermometer:\" class=\"emoji\" alt=\":thermometer:\" loading=\"lazy\" width=\"20\" height=\"20\">  <strong>Temperature Check Requirements</strong></p>\n<ol>\n<li>The draft Proposal must be formatted based on the SIP Template at the bottom of this proposal.</li>\n<li>Once your proposal is out, internal moderators at SuperRare Labs will review. If the proposal has been sufficiently drafted, a moderator will post it to the <a href=\"https://discord.gg/tgtnrYrtpS\" rel=\"noopener nofollow ugc\">SuperRare Discord</a>, under the #<img src=\"https://forum.rare.xyz/images/emoji/twitter/thermometer.png?v=12\" title=\":thermometer:\" class=\"emoji\" alt=\":thermometer:\" loading=\"lazy\" width=\"20\" height=\"20\">| temp_check channel. Here, the community will give a thumbs up or down to your proposal as is, with supporting discussion taking place in # <img src=\"https://forum.rare.xyz/images/emoji/twitter/speech_balloon.png?v=12\" title=\":speech_balloon:\" class=\"emoji\" alt=\":speech_balloon:\" loading=\"lazy\" width=\"20\" height=\"20\"> | dao_chat.</li>\n<li>The Proposal must be actively discussed for a minimum of five days.</li>\n<li>The Author must meaningfully consider and respond to any reasonable feedback, questions, or suggestions from the community.</li>\n</ol>\n  <aside>\n<p><img src=\"https://forum.rare.xyz/images/emoji/twitter/point_up.png?v=12\" title=\":point_up:\" class=\"emoji\" alt=\":point_up:\" loading=\"lazy\" width=\"20\" height=\"20\"> <em>Temperature checks are simply to gauge sentiment, and do not directly determine whether a proposal will be sponsored by a Council member. Council members must consider all of the facts and circumstances surrounding a Proposal in its decision to sponsor or not sponsor a given Proposal.</em></p>\n  </aside>\n</li>\n<li>\n<p><strong>II. Proposal Intake and Optimization</strong></p>\n<p>To incentivize direct collaboration between individual Council members and other community members, all Proposals must be formally and publicly sponsored by at least one Council member in order to go up for a final $RARE token holder vote. Council members who submit Proposals must receive a sponsorship from a different Council member.</p>\n<p><img src=\"https://forum.rare.xyz/images/emoji/twitter/inbox_tray.png?v=12\" title=\":inbox_tray:\" class=\"emoji\" alt=\":inbox_tray:\" loading=\"lazy\" width=\"20\" height=\"20\"> <strong>Proposal Intake</strong></p>\n<p>The intake process begins when one or more Council member(s) publicly sponsor a Proposal after a Temperature Check.</p>\n<ol>\n<li>The Proposal is assigned a number</li>\n<li>The Proposal is assigned an estimated Consensus date</li>\n<li>The Proposal is posted by the Sponsor in the <span class=\"hashtag-raw\">#governance</span> Discord channel as a Request for Comment.</li>\n</ol>\n<p><img src=\"https://forum.rare.xyz/images/emoji/twitter/recycle.png?v=12\" title=\":recycle:\" class=\"emoji\" alt=\":recycle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <strong>Proposal Optimization</strong></p>\n<p>Any big idea requires detailed analysis and discussion before it can be implemented.  Sponsored proposals that prove to be of great community interest during the Temperature Check are further debated, discussed, and optimized before being put forth for a $RARE token holder vote.</p>\n<ol>\n<li>Community members (including Council members) scrutinize and discuss the feasibility and implementation details of the Proposal during a community comment period established by the Council.</li>\n<li>The Proposal Author must respond to questions, feedback, and suggested revisions offered during the comment period.</li>\n<li>The Proposal Author must deliver a final Proposal with an explanation for any edits made to the original draft.</li>\n<li>The Proposal must satisfy all feasibility and logistical requirements or conditions established by the Council</li>\n</ol>\n</li>\n<li>\n<p><strong>III. Consensus</strong></p>\n<p>Any Proposal arriving at the Consensus stage must have undergone community optimization, addressed all Council and community concerns, and be in final condition to be voted on by $RARE token holders. The Council Sponsor(s)  will create a simple “YES” or “NO” vote on <a href=\"https://snapshot.org/#/superraredao.eth\" rel=\"noopener nofollow ugc\">Snapshot</a> for the final Proposal.</p>\n<p><strong>Voting Requirement:</strong> 51% Majority Vote “YES” to pass</p>\n<p><strong>Quorum Requirement:</strong> 5,000,000 $RARE</p>\n<p><strong>Minimum Voting Period:</strong> 7 Days</p>\n</li>\n<li>\n<p><strong>IV. Implementation</strong></p>\n<p>When a Proposal passes a community vote, the Council shall work directly with the Author to execute the Proposal. During implementation the author and sponsor will post updates in the forum and share details on the forum once fully executed.</p>\n</li>\n<li>\n<p><strong>VI. Emergency Proposals</strong></p>\n<p>The Council has virtually unlimited discretion to bypass ordinary governance or SIP procedures to implement emergency proposals and actions necessary to preserve the safety or security of the SuperRare network, its users, or the DAO’s assets. Examples of emergencies include but are not limited to security breaches, violations of core principles, network attacks, etc.</p>\n</li>\n</ul>\n<h1><a name=\"the-sip-template-4\" class=\"anchor\" href=\"#the-sip-template-4\"></a><strong>The SIP Template</strong></h1>\n<p>What belongs in an SIP? A successful SIP should have:</p>\n<ul>\n<li><strong>Title</strong> - Simple and informative title. <em>Suggested word limit - 10</em></li>\n<li><strong>Preamble</strong> - Headers should include; Author, Status, Type, Implementor, Sponsor(s), Link to Temperature Check Poll, Created Date. <em>Suggested word limit - As Needed</em></li>\n<li><strong>Summary</strong> - A short 2-3 sentence description of the SIP. <em>Suggested word limit - 50</em></li>\n<li><strong>Abstract</strong> - Detailed summary that touches on technical aspects and how the network will change. <em>Suggested word limit - 250</em></li>\n<li><strong>Motivation</strong> - Explain why this is being proposed and what the outcome of implementation will be. <em>Suggested word limit - 100</em></li>\n<li><strong>Specification</strong> - Describe full technical details of how this improvement will function and what will be effected. <em>Suggested word limit - 1000</em></li>\n<li><strong>Benefits</strong> - Explain what the explicit benefits of this proposed change are.  <em>Suggested word limit - 100</em></li>\n<li><strong>Drawbacks</strong> - Analyze explicit and potential drawbacks of implementing this update. <em>Suggested word limit - 100</em></li>\n<li><strong>Outcomes</strong> - Explain how we will know whether the proposal was successful or not. Please provide specific metrics that will be tracked, the timeframe for those metrics and how you they will be made available to everyone in the community. <em>Suggested word limit - 100</em></li>\n</ul>","url":"https://forum.rare.xyz/t/superrare-improvement-proposal-procedures-v0/382","status":""},{"id":1625,"t":"SIP | Strategic Partnership Between SuperRare and Transient Labs to Energize Ecosystem","d":"2025-01-29T00:18:40.794Z","c":"<ul>\n<li>Author: <strong><a class=\"mention\" href=\"/u/christl\">@chrisTL</a> (Transient Labs)</strong></li>\n<li>Status: <strong>Proposed</strong></li>\n<li>Type: <strong>Treasury Management</strong></li>\n<li>Implementer: <strong>RareDAO Council &amp; RareDAO Foundation</strong></li>\n<li>Sponsors: <strong>TBD</strong></li>\n<li>Proposal link: <strong>TBD</strong></li>\n<li>Created Date: <strong>January 28, 2025</strong></li>\n</ul>\n<p><strong>Note: The text of this proposal has been updated substantially (2/26/2025) to reflect feedback received from the RareDAO Council. More detail was added on deal terms and specific benefits to the DAO. The previous version is still accessible in the edit history of this post.</strong></p>\n<h2><a name=\"p-3722-summary-1\" class=\"anchor\" href=\"#p-3722-summary-1\"></a>Summary</h2>\n<p>This proposal seeks RareDAO’s approval for a strategic investment in Transient Labs, securing approximately 10% ownership in the company. Through this partnership, Transient Labs will enhance the creator tooling and technology stack for the SuperRare ecosystem, replacing SuperRare’s existing minting infrastructure and integrating advanced creator-centric solutions. This collaboration positions the DAO for long-term growth by expanding revenue streams beyond marketplace transactions and strengthening the utility of the $RARE token.</p>\n<h2><a name=\"p-3722-background-2\" class=\"anchor\" href=\"#p-3722-background-2\"></a>Background</h2>\n<p>Transient Labs is provides the most advanced suite of creative tools for digital artists, projects and brands.  Since its founding in 2021, Transient has helped creators generate more than $70M in revenue, driven millions of on-chain transactions, launched more than 250 projects in partnership with the biggest names in the space including Deekay Motion, Joe Pease, Ripcache, All Seeing Seneca, Die With the Most Likes, SHL0MS, Karborn, and many, many more.  Transient and SuperRare have a long history of productive partnership.  Transient contracts were first to be indexed on SuperRare, Transient has supported and run SR Spaces, assisted with curation and marketing SuperRare artists, and Transient was responsible for the build, implementation and launch of the RARE Pass.  More information can be found here: <a href=\"https://www.transient.xyz/about\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">About | Transient Labs</a></p>\n<h2><a name=\"p-3722-motivation-3\" class=\"anchor\" href=\"#p-3722-motivation-3\"></a>Motivation</h2>\n<p>SuperRare’s strategic commitment toward a highly curated marketplace requires an ecosystem that fosters long-term, value-driven art. By partnering with Transient Labs, SuperRare will be able to offer a seamless creator journey from imagination to curation. This initiative directly addresses:</p>\n<ul>\n<li>The need for sophisticated, sovereign creator tooling and infrastructure.</li>\n<li>The demand for a meaningful, quality-driven cryptoart experience.</li>\n<li>Diversification and expansion of the DAO’s revenue</li>\n<li>Increased surface area for $RARE utility within the ecosystem.</li>\n</ul>\n<p><strong>Goals &amp; Objectives</strong></p>\n<ol>\n<li><strong>Strengthen SuperRare’s Curation Model</strong>: Provide an elite pathway for creators to transition from an open marketplace to curated status.</li>\n<li><strong>Enhance Creator Lifecycle Support</strong>: Integrate Transient’s tooling (Dynamic Art Engine, The Lab, Launchpad, AI Discovery) to empower artists.</li>\n<li><strong>Boost $RARE Token Utility</strong>: Deep integration of $RARE into ecosystem functions, encouraging long-term engagement.</li>\n<li><strong>Increase Platform Awareness and Adoption</strong>: Strategic community growth and targeted market positioning.</li>\n</ol>\n<h2><a name=\"p-3722-specification-4\" class=\"anchor\" href=\"#p-3722-specification-4\"></a>Specification</h2>\n<p><strong>Upon passage of this proposal</strong>, RareDAO will make an investment in Transient Labs, acquiring an equity stake without altering its governance structure. The DAO will not assume new operational responsibilities; rather, this partnership ensures that SuperRare artists have access to the most advanced tooling available in the cryptoart space.</p>\n<h2><a name=\"p-3722-what-this-means-for-the-dao-5\" class=\"anchor\" href=\"#p-3722-what-this-means-for-the-dao-5\"></a>What this means for the DAO:</h2>\n<ul>\n<li><strong>No governance changes</strong>: The DAO remains fully independent, with Transient Labs operating as a service provider and strategic partner.</li>\n<li><strong>A seamless transition</strong>: With SuperRare’s focus on curation and Transient Labs’ world class tooling artists will be fully supported at every stage of their journey.</li>\n<li><strong>A deeper creator ecosystem</strong>: Through Transient Labs, artists will have access to tools that span the entire creator lifecycle—from ideation and design to minting and sales—while SuperRare continues as the premier curated marketplace.</li>\n<li><strong>Operational collaboration</strong>: The SuperRare and Transient Labs teams will work closely to provide ongoing creator support, enhanced curation, and discovery features.</li>\n<li><strong>Expanded creator roles</strong>: This partnership introduces new roles for creators, allowing them to utilize advanced tooling and progress through their artistic journey with greater support and resources.</li>\n</ul>\n<h2><a name=\"p-3722-the-reimagined-flywheel-6\" class=\"anchor\" href=\"#p-3722-the-reimagined-flywheel-6\"></a>The Reimagined Flywheel</h2>\n<p>SuperRare’s traditional flywheel has been centered on curation leading to marketplace sales. With this partnership, the ecosystem evolves into a fully integrated creator lifecycle, enabling sustainable, long-term value creation.</p>\n<p><em><strong>1. Creators enter the ecosystem via Transient Labs’ tooling.</strong></em></p>\n<ul>\n<li>Artists build, ideate, design, mint, and sell using the most advanced tools in the space.</li>\n<li>Transient Labs’ technology lowers the barrier for new creators, driving more on-chain activity.</li>\n</ul>\n<p><em><strong>2. Enhanced curation and discovery.</strong></em></p>\n<ul>\n<li>SuperRare remains the most exclusive curated platform, now with direct access to the strongest emerging talent.</li>\n<li>Transient Labs enables deeper artist discovery, allowing creators to progress toward SuperRare’s curated marketplace.</li>\n</ul>\n<p><em><strong>3. Increased sales, transactions, and protocol fees.</strong></em></p>\n<ul>\n<li>With more artists minting and progressing through the ecosystem, overall sales volume and collector engagement grow.</li>\n<li>A broader range of on-chain activity generates continuous protocol fees that flow into the DAO.</li>\n</ul>\n<p><em><strong>4. Value flows back to the DAO and $RARE holders.</strong></em></p>\n<ul>\n<li>Smart contracts ensure that a portion of all revenue generated through the ecosystem is allocated to the DAO.</li>\n<li>New on-chain activities create a more vibrant ecosystem, driving more interaction and usage of $RARE within the platform.</li>\n</ul>\n<p><em><strong>5. Growth in creators, collectors, and market awareness.</strong></em></p>\n<ul>\n<li>More creators join the ecosystem, more artists reach the curated level, and more collectors engage, strengthening the SuperRare brand.</li>\n<li>This flywheel reinforces itself, continuously expanding the network and revenue base.</li>\n</ul>\n<h2><a name=\"p-3722-roadmap-milestones-7\" class=\"anchor\" href=\"#p-3722-roadmap-milestones-7\"></a>Roadmap &amp; Milestones</h2>\n<p><strong>Phase 1: Q1 2025</strong></p>\n<ul>\n<li>Finalize integration of Transient tooling into the RARE ecosystem.</li>\n<li>Partnership announcement and marketing push.</li>\n<li>Launch token incentive mechanisms.</li>\n</ul>\n<p><strong>Phase 2: Q2 2025</strong></p>\n<ul>\n<li>Onboarding creators and collectors through joint marketing efforts and product launches.</li>\n<li>Implementation of AI discovery and curation mechanisms.</li>\n</ul>\n<p><strong>Phase 3: Q3-Q4 2025</strong></p>\n<ul>\n<li>Scaling marketplace adoption.</li>\n<li>Hosting major events and exhibitions to drive awareness.</li>\n<li>Exploring additional collaborations and monetization avenues.</li>\n</ul>\n<h1><a name=\"p-3722-benefits-8\" class=\"anchor\" href=\"#p-3722-benefits-8\"></a>Benefits</h1>\n<p>This investment fundamentally enhances RareDAO’s financial sustainability and strengthens the $RARE token economy. Unlike traditional NFT marketplaces that rely solely on transaction-based revenue, Transient Labs’ model generates protocol fees across multiple stages of the creator lifecycle, offering a diversified and resilient revenue stream.</p>\n<ul>\n<li><strong>Expanded revenue model</strong>: Transient Labs introduces revenue streams beyond sales, including minting, auctions, smart contract interactions, and other on-chain activity.</li>\n<li><strong>Automated fee distribution</strong>: A smart contract-based protocol fee split will ensure that a portion of revenues flows back to the DAO treasury automatically, creating a continuous source of funding.</li>\n<li><strong>$RARE token utility</strong>: By diversifying revenue and adding new value capture mechanisms for the DAO, along with ongoing changes to the US regulatory environment, the surface area for token utility experiments like the first iteration of <a href=\"https://forum.rare.xyz/t/sip-deploy-rare-staking-to-ethereum-mainnet/1378\">$RARE Staking</a> is significantly increased.</li>\n<li><strong>Resilience in a shifting market</strong>: Given the market’s downturn, shifting towards a diversified revenue model ensures the DAO’s ability to sustain operations and growth beyond just marketplace transactions.</li>\n</ul>\n<p>By integrating Transient Labs’ technology, RareDAO secures a more sustainable, diversified financial model that aligns with the long-term growth of cryptoart.</p>\n<p><strong>Projected ROI:</strong></p>\n<ul>\n<li>Increased transaction volume and engagement.</li>\n<li>Strengthened brand positioning as the leading cryptoart ecosystem.</li>\n<li>Protocol Fee payouts to the DAO</li>\n<li>Higher $RARE adoption and value accrual.</li>\n</ul>\n<h1><a name=\"p-3722-drawbacks-9\" class=\"anchor\" href=\"#p-3722-drawbacks-9\"></a>Drawbacks</h1>\n<p><strong>Investment Risk</strong>: Acquiring equity in Transient Labs involves financial risk, including the potential for loss if Transient Labs does not achieve projected growth.</p>\n<p><strong>Coordination overhead for SRL &amp; Transient Labs</strong>: Increased collaboration between SuperRare Labs and Transient Labs engineering teams presents possible challenges in coordination, though due to the familiarity of the teams and shared incentive to drive value to the $RARE ecosystem, this is not expected to pose any significant challenge</p>\n<p><strong>Dependency on Partner’s Success</strong>: RareDAO’s success in this initiative is partly tied to Transient Labs’ ability to deliver and innovate, creating a dependency on their performance.</p>\n<p><strong>Potential Governance Complexity</strong>: Although the governance structure remains unchanged, the partnership may introduce new layers of decision-making and operational collaboration that could complicate governance processes.</p>\n<h1><a name=\"p-3722-implementation-10\" class=\"anchor\" href=\"#p-3722-implementation-10\"></a>Implementation</h1>\n<p>Upon passage of this proposal:</p>\n<ol>\n<li>RareDAO Foundation and Transient Labs will finalize and execute the investment agreement, including the calculation of a 60-day time weighted average price (TWAP).</li>\n<li>RareDAO Foundation will work with the DAO Council to transfer the invested assets, as calculated in the TWAP, to Transient Labs.</li>\n<li>Transient Labs, RareDAO Foundation, and SuperRare Labs will collaborate extensively to manage execution of the vision and roadmap outlined above.</li>\n</ol>","url":"https://forum.rare.xyz/t/sip-strategic-partnership-between-superrare-and-transient-labs-to-energize-ecosystem/1625","status":"ecosystem-growth, protocol-development, rare"},{"id":1631,"t":"SIP | Improve $RARE liquidity on Decentralized Exchanges","d":"2025-02-08T00:58:54.740Z","c":"<ul>\n<li>Author: <strong>Brennan Mulligan (RareDAO Foundation)</strong></li>\n<li>Status: <strong><a href=\"https://snapshot.box/#/s:superraredao.eth/proposal/0xf52a79036ca48acf536c0c4499a1e1d3f79c540adf6172ac60897c090cacca5b\">Voting</a></strong></li>\n<li>Type: <strong>Treasury Management</strong></li>\n<li>Implementer: <strong>RareDAO Council &amp; RareDAO Foundation</strong></li>\n<li>Sponsors: <strong><a href=\"https://forum.rare.xyz/u/SuperRareJohn\">SuperRareJohn</a></strong></li>\n<li>Proposal link: <strong>TBD</strong></li>\n<li>Created Date: <strong>February 7, 2025</strong></li>\n</ul>\n<h2><a name=\"p-3739-summary-1\" class=\"anchor\" href=\"#p-3739-summary-1\"></a>Summary</h2>\n<p>We propose allocating $500,000 in treasury funds to create full-range liquidity pools on Ethereum and Base for the $RARE/ETH pair using Uniswap v4. This initiative will increase dex liquidity, enhance price stability, and reduce slippage. It complements our established centralized exchange market-making efforts and lays the foundation for healthier $RARE markets overall.</p>\n<h2><a name=\"p-3739-background-2\" class=\"anchor\" href=\"#p-3739-background-2\"></a>Background</h2>\n<p>Through previous community proposals (<a href=\"https://snapshot.box/#/s:superraredao.eth/proposal/0x1763d237ee98337d62ea0a3d96c4aaae110bc0be373c86c7169bdbfc78d38b62\">SIP-7</a> &amp; <a href=\"https://snapshot.box/#/s:superraredao.eth/proposal/0xe8b93f8e5982cf4e43e30e02beadd3220b32cc7e9027d84337743e09803d8729\">SIP-17</a>), we have secured strong market-making relationships that boost liquidity on centralized exchanges. However, our decentralized exchange (DEX) liquidity remains very low, resulting in high slippage and price volatility.</p>\n<p>This SIP seeks to launch an official effort to significantly improve DEX liquidity. By deploying treasury funds into full-range liquidity pools on Uniswap v4, we aim to achieve greater price stability and trading efficiency, ultimately benefiting all $RARE users.</p>\n<h2><a name=\"p-3739-specification-3\" class=\"anchor\" href=\"#p-3739-specification-3\"></a>Specification</h2>\n<h3><a name=\"p-3739-liquidity-allocation-4\" class=\"anchor\" href=\"#p-3739-liquidity-allocation-4\"></a>Liquidity Allocation</h3>\n<ul>\n<li><strong>Total Amount:</strong> $500,000 in treasury funds.</li>\n<li><strong>Network Split:</strong> $250,000 for Ethereum and $250,000 for Base.</li>\n<li><strong>Pairing:</strong> Funds will be matched evenly between $RARE and ETH in each pool.</li>\n</ul>\n<h3><a name=\"p-3739-process-5\" class=\"anchor\" href=\"#p-3739-process-5\"></a>Process</h3>\n<ol>\n<li><strong>Price Determination:</strong><br>\nAfter the proposal period, a time-weighted average price (TWAP) of $RARE will be used to calculate the precise amounts of $RARE and ETH required for each network.</li>\n<li><strong>Fund Transfer:</strong><br>\nThe calculated amounts will be transferred from the Treasury to a Foundation-controlled externally owned account (EOA).</li>\n<li><strong>Pool Deployment:</strong><br>\nThe Foundation will deploy two full-range liquidity pools on Uniswap v4—one on Ethereum and one on Base—and deposit the funds accordingly. Full-range liquidity is chosen for its simplicity and broad coverage, ensuring liquidity is available across all price levels with minimal ongoing management.</li>\n</ol>\n<h3><a name=\"p-3739-why-uniswap-v4-6\" class=\"anchor\" href=\"#p-3739-why-uniswap-v4-6\"></a>Why Uniswap v4</h3>\n<p>Uniswap v4 delivers improved capital efficiency and dynamic fee structures over previous versions, enabling more effective liquidity deployment with lower slippage.</p>\n<h2><a name=\"p-3739-benefits-7\" class=\"anchor\" href=\"#p-3739-benefits-7\"></a>Benefits</h2>\n<ul>\n<li><strong>Increased Market Depth:</strong><br>\nBroad, full-range liquidity reduces slippage, enabling smoother and more efficient trade execution.</li>\n<li><strong>Enhanced Price Stability:</strong><br>\nA deeper liquidity pool across the entire price spectrum stabilizes market conditions and mitigates sharp price swings.</li>\n<li><strong>Transparent Treasury Utilization:</strong><br>\nDirect deployment from the Treasury, with on-chain verifiability, fosters community trust and clear accountability.</li>\n</ul>\n<h2><a name=\"p-3739-drawbacks-8\" class=\"anchor\" href=\"#p-3739-drawbacks-8\"></a>Drawbacks</h2>\n<ul>\n<li><strong>Opportunity Cost:</strong><br>\nAllocating $500,000 to this initiative means those funds cannot be redirected to other projects or investments in the near term.</li>\n<li><strong>Passive Management:</strong><br>\nWhile full-range liquidity requires minimal day-to-day oversight, the pools will still need periodic reviews to ensure they continue to meet market demands.</li>\n<li><strong>Limited Fee Optimization:</strong><br>\nFull-range liquidity may generate lower transaction fee revenue compared to highly concentrated liquidity strategies, although our primary goal is reducing slippage rather than maximizing transaction fees.</li>\n</ul>\n<h2><a name=\"p-3739-implementation-9\" class=\"anchor\" href=\"#p-3739-implementation-9\"></a>Implementation</h2>\n<ol>\n<li><strong>Price Calculation:</strong><br>\nIf approved, calculate the TWAP of $RARE over the proposal period to determine the exact amounts of $RARE and ETH required for each network.</li>\n<li><strong>Fund Transfer:</strong><br>\nTransfer the computed amounts from the Council multisig to a Foundation-controlled EOA.</li>\n<li><strong>Liquidity Pool Deployment:</strong><br>\nThe Foundation will two full-range Uniswap v4 liquidity pools (one on Ethereum and one on Base) and deposit equal amounts of $RARE and ETH into each pool.</li>\n</ol>","url":"https://forum.rare.xyz/t/sip-improve-rare-liquidity-on-decentralized-exchanges/1631","status":"treasury-management"},{"id":1496,"t":"SIP | Deployment of Core Protocol Contracts to Base","d":"2024-06-25T21:01:15.810Z","c":"<p>Author: <strong>Brennan Mulligan (RareDAO Foundation)</strong></p>\n<p>Status: <strong>Implemented</strong></p>\n<p>Type: <strong>Protocol Development</strong></p>\n<p>Implementer: <strong>RareDAO Foundation</strong></p>\n<p>Sponsor(s): <a class=\"mention\" href=\"/u/superrarejohn\">@SuperRareJohn</a></p>\n<p>Created Date: <strong>June 25, 2024</strong></p>\n<h1><a name=\"p-3394-summary-1\" class=\"anchor\" href=\"#p-3394-summary-1\"></a>Summary</h1>\n<p>This proposal aims to enhance the utility and accessibility of the $RARE token and Rare Protocol by deploying core components to the Base layer 2 blockchain. Key elements include:</p>\n<ol>\n<li>Deploying the $RARE token to Base, along with a new Rare Bridge using Chainlink’s CCIP for secure cross-chain transfers.</li>\n<li>Deploying the marketplace contracts to Base to enable experimentation and align with the grants program.</li>\n<li>Duplicating the council multisig on Base to maintain DAO governance over contract upgrades and fee accumulation.</li>\n</ol>\n<h1><a name=\"p-3394-specification-2\" class=\"anchor\" href=\"#p-3394-specification-2\"></a>Specification</h1>\n<p>The proposal is divided into three main parts, each addressing a critical aspect of enhancing the functionality and governance of the Rare Protocol.</p>\n<h2><a name=\"p-3394-part-1-deployment-of-the-rare-token-and-rare-bridge-to-base-3\" class=\"anchor\" href=\"#p-3394-part-1-deployment-of-the-rare-token-and-rare-bridge-to-base-3\"></a>Part 1: Deployment of the $RARE Token and Rare Bridge to Base</h2>\n<p>To enhance the accessibility and scalability of the $RARE token, we propose deploying it to Base along with the Rare Bridge, a secure cross-chain bridge powered by Chainlink’s CCIP. The high gas costs on Ethereum mainnet have driven users to seek lower-fee environments, making it essential for Rare Protocol to adapt and scale. By deploying the $RARE token and Rare Bridge to Base, we aim to capitalize on the lower transaction costs and growing adoption of Layer 2 solutions.</p>\n<h3><a name=\"p-3394-deployment-components-4\" class=\"anchor\" href=\"#p-3394-deployment-components-4\"></a>Deployment Components:</h3>\n<ol>\n<li><strong>Ethereum (L1) Bridge:</strong> The Lock and Unlock Bridge Contract on Ethereum will handle the locking of $RARE tokens on the mainnet. When a user interacts with this bridge to lock their tokens, it sends a message to the L2 Bridge on Base via Chainlink’s decentralized oracle network.</li>\n<li><strong>Base (L2) Bridge:</strong> The Burn and Mint Bridge Contract on Base will receive messages from the L1 Bridge and mint new $RARE tokens on the Base network. These tokens will be transferred to the user’s address, enabling them to utilize their $RARE tokens on Base for transactions, transfers, or sales.</li>\n<li><strong>L2 $RARE Token:</strong> A new $RARE token contract has been created to support burn and mint functionalities,which are required to support the L2 bridge. This ensures that users can move their tokens back to Ethereum by burning them on Base and unlocking the original tokens on the mainnet. This contract will only ever be deployed to L2 and is not a replacement for the original token on Ethereum.</li>\n</ol>\n<p>The repo for the Rare Bridge and L2 token contracts can be found <a href=\"https://github.com/rareprotocol/rare-bridge\">here</a>, and the audit can be found <a href=\"https://drive.google.com/file/d/15kg3WZEPKx31PZ6XBSy9qI_04lC-v92n/view\">here</a>.</p>\n<h3><a name=\"p-3394-chainlink-ccip-integration-5\" class=\"anchor\" href=\"#p-3394-chainlink-ccip-integration-5\"></a>Chainlink CCIP Integration</h3>\n<p>The Rare Bridge will be implemented using <a href=\"https://docs.chain.link/ccip\">Chainlink’s Cross-Chain Interoperability Protocol (CCIP)</a>. CCIP is a decentralized and secure standard for cross-chain communication, enabling seamless interoperability between different blockchain networks.</p>\n<p>Key benefits of using Chainlink CCIP for the Rare Bridge include:</p>\n<ol>\n<li><strong>Decentralized Security:</strong> CCIP leverages Chainlink’s decentralized network of oracles to securely relay messages between chains. This eliminates single points of failure and ensures that the bridge is resilient to attacks or manipulation.</li>\n<li><strong>Anti-Fraud Measures:</strong> CCIP includes built-in anti-fraud protections, such as the ability to verify the integrity of cross-chain messages using cryptographic proofs. This ensures that only valid messages from authorized contracts are processed by the bridge.</li>\n<li><strong>Standardized Interface:</strong> By adopting CCIP, the Rare Bridge benefits from a standardized and well-tested interface for cross-chain communication. This reduces the risk of implementation errors and ensures compatibility with other CCIP-based bridges and protocols.</li>\n</ol>\n<h3><a name=\"p-3394-why-choose-base-for-the-first-deployment-6\" class=\"anchor\" href=\"#p-3394-why-choose-base-for-the-first-deployment-6\"></a>Why choose Base for the first deployment?</h3>\n<p>Our proposal to use Base as the first Layer 2 deployment is based on several factors, including its access to retail consumers, adoption within the onchain art ecosystem, and integration with Optimism’s “superchain.” This positions Base as a highly performant and scalable option, increasing our total addressable market and reducing transaction costs for users compared to Ethereum alone. Furthermore, Base’s connection to the broader Ethereum ecosystem through Optimism ensures that we maintain strong ties to the mainnet while benefiting from Layer 2 efficiencies.</p>\n<h3><a name=\"p-3394-impact-on-existing-rare-holders-7\" class=\"anchor\" href=\"#p-3394-impact-on-existing-rare-holders-7\"></a>Impact on Existing $RARE Holders</h3>\n<p>It’s important to note that this Base deployment will not have any adverse effects on existing $RARE token holders:</p>\n<ul>\n<li>$RARE tokens on Ethereum will continue to function as normal.</li>\n<li>The total supply of $RARE across both networks will remain constant, as Base tokens are only minted when Ethereum tokens are locked and vice versa.</li>\n<li>Holders can freely move their tokens between Ethereum and Base using the bridge, allowing them to take advantage of Base’s lower fees without losing any functionality.</li>\n</ul>\n<h2><a name=\"p-3394-part-2-deployment-of-the-marketplace-contracts-to-base-8\" class=\"anchor\" href=\"#p-3394-part-2-deployment-of-the-marketplace-contracts-to-base-8\"></a>Part 2: Deployment of the Marketplace Contracts to Base</h2>\n<p>In addition to the $RARE token and Rare Bridge, we propose deploying the marketplace contracts to Base. While there are no immediate plans to integrate these contracts with <a href=\"http://SuperRare.com\">SuperRare.com</a>, making them available on Base has several benefits:</p>\n<ol>\n<li><strong>Enabling Experimentation:</strong> Deploying the marketplace contracts opens up opportunities for developers to build new experiences and integrations. This can help inform our future roadmap for Layer 2 expansion.</li>\n<li><strong>Grants Program Alignment:</strong> Having the contracts on Base creates another surface area for grant recipients to build on, extending our recent work with initiatives like the development of Farcaster frames and Rare Tipping.</li>\n</ol>\n<p>It’s important to note that this proposal only seeks authorization for the deployment of the marketplace contracts themselves. It does not imply any immediate commitment to indexing, UI integration, or other changes to <a href=\"http://SuperRare.com\">SuperRare.com</a>.</p>\n<h2><a name=\"p-3394-part-3-duplication-of-the-council-multisig-9\" class=\"anchor\" href=\"#p-3394-part-3-duplication-of-the-council-multisig-9\"></a>Part 3: Duplication of the Council Multisig</h2>\n<p>To maintain DAO governance over contract deployments on Base, we propose deploying a duplicate of the current council multisig. This new multisig will:</p>\n<ul>\n<li>Have the same signers as the mainnet multisig</li>\n<li>If possible, have the same address as the mainnet multisig</li>\n</ul>\n<p>The Base multisig will be granted upgrade authority over all Rare Protocol contracts deployed to Base under this proposal. This ensures that the DAO retains control over the official Base deployments.</p>\n<p>We recognize that duplicating the multisig is a short-term solution with some drawbacks:</p>\n<ul>\n<li>Increased coordination overhead for signers</li>\n<li>Scalability concerns as Rare expands to more Layer 2s</li>\n</ul>\n<p>However, we believe this is an acceptable tradeoff to move quickly on the Base deployment while preserving DAO governance. In the future, we plan to explore more scalable approaches like executable voting via Tally’s Multigov feature. The Base deployment will provide valuable learnings to inform this transition.</p>\n<h1><a name=\"p-3394-benefits-10\" class=\"anchor\" href=\"#p-3394-benefits-10\"></a>Benefits</h1>\n<ol>\n<li><strong>Lower Transaction Costs:</strong> Deploying on Base reduces transaction fees by 50-100x compared to Ethereum, making $RARE more accessible and easier to use.</li>\n<li><strong>Increased Adoption:</strong> Base’s tight integration with Coinbase and widespread adoption within the Farcaster community opens Rare Protocol to a large user base.</li>\n<li><strong>Experimentation:</strong> Deploying contracts in a low fee environment enables experimentation and contributions from the community.</li>\n</ol>\n<h1><a name=\"p-3394-drawbacks-11\" class=\"anchor\" href=\"#p-3394-drawbacks-11\"></a>Drawbacks</h1>\n<ol>\n<li><strong>Coordination Overhead:</strong> Managing multisigs across chains adds complexity for signers.</li>\n<li><strong>Long-Term Scalability:</strong> Duplicating the council multisig is a short-term fix, not a scalable cross-chain governance solution.</li>\n</ol>\n<h1><a name=\"p-3394-proposal-execution-12\" class=\"anchor\" href=\"#p-3394-proposal-execution-12\"></a>Proposal Execution</h1>\n<p>Upon passage of this proposal, the following shall be resolved:</p>\n<ol>\n<li>RareDAO Foundation is authorized to deploy the L1 Bridge, L2 Bridge, L2 Token, and any other related contracts necessary for deployment and bridging of the token to EVM L2s at its discretion or by request of the DAO council.</li>\n<li>RareDAO Foundation is authorized to deploy all protocol contracts necessary for marketplace operation on Base. These deployments may include minor changes such as specifying different contract addresses for other deployed contracts, and logic to avoid errors due to the absence of Staking contracts on Base at this time.</li>\n<li>RareDAO Foundation shall deploy or actively support the deployment of a new council multisig on any chain to which it is deploying or has deployed protocol contracts, unless some other crosschain governance mechanism is defined in a later proposal.</li>\n</ol>","url":"https://forum.rare.xyz/t/sip-deployment-of-core-protocol-contracts-to-base/1496","status":"protocol-development"},{"id":1610,"t":"[SIP] Grant a multi-year endowment to the RareDAO Foundation","d":"2024-12-09T20:40:29.542Z","c":"<ul>\n<li>Authors: <strong>Brennan Mulligan</strong> (General Manager @ RareDAO Foundation), <strong>John Crain</strong> (RareDAO Council Member, SuperRare Labs CEO)</li>\n<li>Status: <strong>Approved</strong></li>\n<li>Implementer: <strong>RareDAO Foundation</strong></li>\n<li>Sponsor: <strong><a class=\"mention\" href=\"/u/emma\">@Emma</a></strong> (RareDAO Council Member)</li>\n<li>Proposal: <a href=\"https://snapshot.box/#/s:superraredao.eth/proposal/0x57a7a7f467fe7fe51022f65be5776153b6710e380237e2c28dab24ebb30f8983\"><strong>Snapshot</strong></a></li>\n<li>Created: <strong>December 9, 2024</strong></li>\n</ul>\n<h1><a name=\"summary-1\" class=\"anchor\" href=\"#summary-1\"></a>Summary</h1>\n<p>This proposal requests a multi-year endowment of 85M $RARE to be managed by RareDAO Foundation in order to simplify operations, improve treasury strategy, and strengthen financial stability. By transferring routine payment responsibilities to the Foundation and working with professional asset managers, it aims to reduce administrative overhead for the council, optimize resource allocation, and better support long-term strategic initiatives.</p>\n<h1><a name=\"background-motivation-2\" class=\"anchor\" href=\"#background-motivation-2\"></a>Background &amp; Motivation:</h1>\n<p>The RareDAO Foundation was originally established to serve as a legal entity for the DAO, providing regulatory compliance and liability protection for both token holders and contributors. Over the past year, we have successfully increased operational independence by transferring responsibilities from SuperRare Labs (SRL) to the Foundation. Additionally, we have launched multiple experiments for deeper community engagement with $RARE, including the $RARE tipping program on Farcaster and more recently $RARE rewards, while continuing to ship iterative improvements to <a href=\"http://superrare.com\">superrare.com</a> and staying on the cutting edge of regulatory compliance.</p>\n<p>That said, there are still a number of operational inefficiencies in the current structure. The community elected DAO council continues to be responsible for some unnecessary operational tasks, such as service provider payments. This makes such payments very cumbersome, and other more complex tasks such as treasury management more difficult to coordinate around. As an iterative improvement on the model established last year with the Foundation’s first annual budget request, we propose establishing an endowment which will allow more efficient execution of routine operations, overseen by RareDAO Foundation, and more nuanced approaches to critical tasks such as treasury management, we will be better equipped to bring value to the community as a whole.</p>\n<p><strong>Objectives of This Proposal:</strong></p>\n<ol>\n<li><strong>Transfer Payment Responsibilities:</strong> Shift the responsibility of paying SuperRare Labs and related service provider expenses from the DAO governance council to the RareDAO Foundation, simplifying the current process and achieving better alignment with the community approved service agreement.</li>\n<li><strong>Establish a Multi-Year Endowment:</strong> Request an allocation from the community treasury to fund a multi-year endowment for the RareDAO Foundation, which will cover operational costs for itself and any service providers (including SuperRare Labs) as well as opening new opportunities for growth initiatives, and community engagement, treasury management, and diversification.</li>\n<li><strong>Ensure Marketplace Revenue Continuity:</strong> All revenue generated from marketplace activity will continue to flow into the community treasury, maintaining a clear separation between operational resources and revenue inflows.</li>\n</ol>\n<h1><a name=\"specification-3\" class=\"anchor\" href=\"#specification-3\"></a>Specification:</h1>\n<p>To achieve the above objectives, we are requesting an allocation of 85M $RARE from the community treasury, amounting to roughly 30% of reserves.</p>\n<p>These assets will be consolidated in a managed endowment under the RareDAO Foundation’s control, held in a new gnosis safe created by the Foundation. This endowment will allow the Foundation to optimize cash flow management, diversify holdings, and extend its runway. RareDAO Foundation has already undergone an extensive search process for qualified treasury managers, and will be partnering with Avantgarde for initial setup and execution of a diversification strategy which minimizes price impact while still being able to respond to the market and prioritize trading during periods of high volume and market depth. While Avantgarde has been selected as the initial service provider, the Foundation will retain the ability to add, change or remove providers based on performance or any other factors after an initial commitment period.</p>\n<p><strong>About Avantgarde:</strong></p>\n<p>Avantgarde is crypto native asset management that specializes in running non-custodial on-chain asset management strategies, leveraging DeFi protocols and tools to build solutions for clients.</p>\n<p>Avantgarde has been active in DeFi since 2016, notably as co-founders of the on-chain asset management protocol Enzyme, and brings decades of experience from reputable TradFi firms to help DAOs and Foundations optimise treasury management strategies, improve financial sustainability, and support long-term growth. Past and current clients include Uniswap, Arbitrum, Safe, Gitcoin, Nexus Mutual, amongst others.</p>\n<h1><a name=\"benefits-4\" class=\"anchor\" href=\"#benefits-4\"></a>Benefits:</h1>\n<ol>\n<li><strong>Operational Flexibility &amp; Financial Stability:</strong></li>\n</ol>\n<ul>\n<li>The endowment approach provides the Foundation with the flexibility to strategically time the sale of $RARE and other assets during periods of high market liquidity, reducing price impact. This contrasts with an annual budget model that may force asset sales during periods of low liquidity or unfavorable market conditions.</li>\n<li>By consolidating operational funding into a multi-year endowment, the Foundation can focus on strategic initiatives rather than yearly budget renewals.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Optimized Treasury Management:</strong></li>\n</ol>\n<ul>\n<li>With a secured endowment, the Foundation will be able to actively manage its treasury, leveraging strategies to diversify into ETH and stablecoins while minimizing market impact. This will result in a more sustainable treasury strategy than is available under the current framework.</li>\n</ul>\n<ol start=\"3\">\n<li><strong>Simplification of Financial Processes:</strong></li>\n</ol>\n<ul>\n<li>Transferring payment responsibilities to the Foundation will streamline operations, reducing administrative overhead and aligning contractual obligations with the responsible entity.</li>\n</ul>\n<h1><a name=\"drawbacks-5\" class=\"anchor\" href=\"#drawbacks-5\"></a>Drawbacks:</h1>\n<ol>\n<li><strong>Reduced liquidity available to other SIPs:</strong> Any allocation of a significant portion of the community treasury reduces the amount of $RARE available for other community proposals. However, this is offset by the long-term benefits of strategic asset management and reduced future funding requests.</li>\n<li><strong>Balancing flexibility with oversight:</strong> While the shift to a multi-year endowment offers greater flexibility, it requires trust in the Foundation’s ability to manage these assets responsibly. To address this, we commit to periodic updates and transparency based on community interest.</li>\n</ol>\n<h1><a name=\"proposal-execution-6\" class=\"anchor\" href=\"#proposal-execution-6\"></a>Proposal Execution:</h1>\n<p>Upon passage of this proposal, the DAO council shall transfer 85,000,000 $RARE tokens from the community treasury to a new multi-sig created by the Foundation. These funds shall be used for operational expenses, as well as growth and marketing initiatives, or any other activity which is in the best interest of the community.</p>","url":"https://forum.rare.xyz/t/sip-grant-a-multi-year-endowment-to-the-raredao-foundation/1610","status":"treasury-management"},{"id":1602,"t":"[SIP] Add Batch Offers Contract to Rare Protocol (Ethereum Mainnet)","d":"2024-10-16T17:45:59.358Z","c":"<ul>\n<li>Authors: <strong>Ryan Collins, Charles Crain, Matt Casagrande, Phil Readman, Rohit Kapoor, Brennan Mulligan</strong></li>\n<li>Status: <strong>Approved</strong></li>\n<li>Implementer: <strong>RareDAO Foundation</strong></li>\n<li>Sponsor: <strong><a class=\"mention\" href=\"/u/emma\">@Emma</a></strong></li>\n<li>Created: <strong>October 16, 2024</strong></li>\n</ul>\n<h1><a name=\"summary-1\" class=\"anchor\" href=\"#summary-1\"></a>Summary</h1>\n<p>In this SIP we introduce the concept of Batch Offers, a new addition to Rare Protocol designed to enhance the collector experience on SuperRare by allowing users to place blanket offers on a series of works from an artist. This eliminates the need for collectors to manually put offers on each piece within the same series, streamlining the acquisition process for series-based artworks.</p>\n<h1><a name=\"motivation-2\" class=\"anchor\" href=\"#motivation-2\"></a>Motivation</h1>\n<p>Currently, collectors must manually place offers on each individual artwork in a series. This can be time-consuming and cumbersome, especially when dealing with large series from prolific artists. As artists on SuperRare continue to expand their collections and create multiple pieces within a series, collectors have expressed the need for a more efficient way to make offers across entire series’ without repetitive tasks.</p>\n<p>The motivation behind the Batch Offers functionality is to create a more efficient marketplace for series-based artworks. By reducing the friction in the offer-making process, we believe collectors will be more likely to engage with and purchase multiple works from a series. This increases engagement on SuperRare and leads to greater sales for artists.</p>\n<h1><a name=\"background-user-experience-3\" class=\"anchor\" href=\"#background-user-experience-3\"></a>Background &amp; User Experience</h1>\n<p><em>In this section, we provide a high-level overview of how this functionality works from a user experience perspective, targeted towards collectors (users making an offer) and owners (users who own a piece which received a batch offer). Please note, this is just background information to help contextualize the smart contract deployment which is the focus of this proposal. Details about the smart contract deployment can be found in the <a href=\"https://forum.rare.xyz/t/sip-add-batch-offers-contract-to-rare-protocol-ethereum-mainnet/1602#protocol-specification-7\">Protocol Specification</a> section. The information that follows is illustrative and may differ from the final implementation on <a href=\"http://SuperRare.com\">SuperRare.com</a>, the details of which are not subject to DAO governance.</em></p>\n<h2><a name=\"functionality-4\" class=\"anchor\" href=\"#functionality-4\"></a>Functionality</h2>\n<p>The Batch Offers feature will enable collectors to place a single offer that applies to all artworks within a specific series. This offer will be broadcast to all current owners of the artworks in that series. The first owner to accept the offer will complete the transaction, after which the offer will automatically be invalidated for the remaining artworks in the series. Additionally, collectors will have the option to revoke their offers at any time before acceptance, providing flexibility and control over their bids.</p>\n<h2><a name=\"user-interface-5\" class=\"anchor\" href=\"#user-interface-5\"></a>User Interface</h2>\n<p>The user interface will be updated to include a “Make a Global Offer” option on the series artwork pages, as demonstrated in the attached mockups. Collectors will be able to set the offer amount, which will apply across all artworks in the series. Additionally, collectors will have the ability to define the expiration period for their offers, choosing between time frames of 24 hours, 3 days, 5 days, or 7 days, depending on their preference.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://forum.rare.xyz/uploads/default/original/2X/8/8d5e569cfc52fc876d0682bfefe8569aa645af87.jpeg\" data-download-href=\"https://forum.rare.xyz/uploads/default/8d5e569cfc52fc876d0682bfefe8569aa645af87\" title=\"Series - Offer\"><img src=\"https://forum.rare.xyz/uploads/default/optimized/2X/8/8d5e569cfc52fc876d0682bfefe8569aa645af87_2_690x498.jpeg\" alt=\"Series - Offer\" data-base62-sha1=\"kaBrq7zfdoAnQAn1zTSTsAalIAD\" width=\"690\" height=\"498\" srcset=\"https://forum.rare.xyz/uploads/default/optimized/2X/8/8d5e569cfc52fc876d0682bfefe8569aa645af87_2_690x498.jpeg, https://forum.rare.xyz/uploads/default/optimized/2X/8/8d5e569cfc52fc876d0682bfefe8569aa645af87_2_1035x747.jpeg 1.5x, https://forum.rare.xyz/uploads/default/optimized/2X/8/8d5e569cfc52fc876d0682bfefe8569aa645af87_2_1380x996.jpeg 2x\" data-dominant-color=\"C9C5BF\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Series - Offer</span><span class=\"informations\">1728×1249 227 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://forum.rare.xyz/uploads/default/original/2X/6/67bedbdfe1498a93dd43d5fb0081508e1f701f50.jpeg\" data-download-href=\"https://forum.rare.xyz/uploads/default/67bedbdfe1498a93dd43d5fb0081508e1f701f50\" title=\"screen2\"><img src=\"https://forum.rare.xyz/uploads/default/optimized/2X/6/67bedbdfe1498a93dd43d5fb0081508e1f701f50_2_690x450.jpeg\" alt=\"screen2\" data-base62-sha1=\"eNM5KsrVczEvoXJe5gfEm5s0Lgk\" width=\"690\" height=\"450\" srcset=\"https://forum.rare.xyz/uploads/default/optimized/2X/6/67bedbdfe1498a93dd43d5fb0081508e1f701f50_2_690x450.jpeg, https://forum.rare.xyz/uploads/default/optimized/2X/6/67bedbdfe1498a93dd43d5fb0081508e1f701f50_2_1035x675.jpeg 1.5x, https://forum.rare.xyz/uploads/default/optimized/2X/6/67bedbdfe1498a93dd43d5fb0081508e1f701f50_2_1380x900.jpeg 2x\" data-dominant-color=\"9F9F9E\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">screen2</span><span class=\"informations\">1600×1045 270 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<h2><a name=\"notifications-6\" class=\"anchor\" href=\"#notifications-6\"></a>Notifications</h2>\n<p>All owners of artworks within the series will be notified when a global offer is placed, allowing them the choice to either accept or reject the offer. Once an offer is accepted by any owner, a follow-up notification will be sent to the remaining owners, informing them that the offer is no longer available. This ensures clarity and prevents any confusion among the owners regarding the status of the offer.</p>\n<h1><a name=\"protocol-specification-7\" class=\"anchor\" href=\"#protocol-specification-7\"></a>Protocol Specification</h1>\n<p>If this proposal is approved, RareDAO Foundation shall deploy a new smart contract, <code>BatchOffer.sol</code>, to Ethereum mainnet. This smart contract allow for the creation of batch offers, will hold the contents (i.e. metadata) of any batch offers, validate offers, facilitate the revocation offers, call the marketplace to escrow and release funds, and remove the offer once the sale is finalized or the offer is revoked.</p>\n<p>The github repo for this functionality can be found <a href=\"https://github.com/rareprotocol/core/pull/37\">here</a>. This code has been audited by an independent 3rd party. Additional audit information may be requested by emailing <a href=\"mailto:support@superrare.com\">support@superrare.com</a>.</p>\n<h1><a name=\"benefits-8\" class=\"anchor\" href=\"#benefits-8\"></a>Benefits</h1>\n<h2><a name=\"for-collectors-9\" class=\"anchor\" href=\"#for-collectors-9\"></a>For Collectors</h2>\n<p>Batch Offers significantly reduce the effort needed to place offers on multiple artworks within a series. Collectors can now make a single offer that applies across an entire body of work, streamlining the acquisition process. This simplification encourages faster acquisitions, allowing collectors to engage more efficiently with series-based collections.</p>\n<h2><a name=\"for-artists-10\" class=\"anchor\" href=\"#for-artists-10\"></a>For Artists</h2>\n<p>This feature increases the visibility of an artist’s series, as collectors are more likely to engage with entire collections rather than individual pieces. By simplifying the offer process, artists are likely to experience quicker sales across their full series, which in turn enhances liquidity and increases overall sales potential.</p>\n<h2><a name=\"for-the-platform-11\" class=\"anchor\" href=\"#for-the-platform-11\"></a>For the Platform</h2>\n<p>Batch Offers improve the overall user experience on SuperRare, making it more attractive to collectors interested in acquiring entire series of artwork. By reducing friction in the offer-making process, this functionality promotes greater marketplace activity, leading to increased series sales and contributing to the platform’s continued growth.</p>\n<h1><a name=\"drawbacks-12\" class=\"anchor\" href=\"#drawbacks-12\"></a>Drawbacks</h1>\n<p>Offer Overlap: If multiple collectors place batch offers on a series simultaneously, there may be confusion regarding offer precedence. This will be managed by the first-come, first-served mechanism in the smart contract and notifications in the <a href=\"http://superrare.com\">superrare.com</a> user interface.</p>\n<h1><a name=\"proposal-execution-13\" class=\"anchor\" href=\"#proposal-execution-13\"></a>Proposal Execution</h1>\n<p>Upon approval of this proposal, RareDAO Foundation shall be authorized and compelled to deploy <code>BatchOffer.sol</code> and any related smart contracts to Ethereum mainnet. After an initial period for testing and user feedback, ownership of the contract shall be granted to the RareDAO Council multisig. During this initial period, minor upgrades may be made for security, gas optimization, or other improvements, though the final implementation shall not materially differ from the source code provided in this proposal.</p>","url":"https://forum.rare.xyz/t/sip-add-batch-offers-contract-to-rare-protocol-ethereum-mainnet/1602","status":"protocol-development"},{"id":1601,"t":"[SIP] Suspend operations related to the Spaces program","d":"2024-09-30T15:36:13.608Z","c":"<ul>\n<li>Author: <strong>Jonathan Perkins (CPO, SuperRare Labs)</strong></li>\n<li>Status: <strong>Approved</strong></li>\n<li>Implementer: <strong>RareDAO Governance Council &amp; SuperRare Labs</strong></li>\n<li>Sponsor(s): <strong><a class=\"mention\" href=\"/u/hudsonsims\">@hudsonsims</a></strong></li>\n<li>Created Date: <strong>September 30, 2024</strong></li>\n</ul>\n<h1><a name=\"background-motivation-1\" class=\"anchor\" href=\"#background-motivation-1\"></a>Background &amp; Motivation</h1>\n<p>RareDAO introduced Spaces in 2021 as a beta initiative to broaden support for artists with marketing and curated exhibitions. The vision was for the community to elect a network of galleries to support artists in exchange for a percentage of sales.</p>\n<p>While successful in mobilizing a passionate community of curators, artists, and voters to give this gallery network model its best shot, the Spaces program has had mixed results, especially during the prolonged NFT downturn. Further, its implementation led to a fragmented user experience on the SuperRare platform. After careful consideration, we’ve made the tough decision to recommend the suspension of the Spaces program.</p>\n<p>This decision stems from two key challenges. First, the market evolved differently than we anticipated, with a contraction in the crypto market and in NFT collectors, rather than the broadening and diversification into sub-niches we expected. Second, in hindsight, SR Labs took on more responsibility for Spaces development than was sustainable, given the demands of simultaneously maintaining the core platform.</p>\n<p>This proposal follows many discussions with Space operators and other members of the community, aiming to gracefully wind down the Spaces UI while keeping the underlying smart contracts accessible for future use. The goal is to free up bandwidth and resources toward new opportunities to expand the cryptoart ecosystem and better support artists.</p>\n<p>For more information about how these changes will affect artists, operators and collectors, please read the FAQ <a href=\"https://help.superrare.com/en/articles/9939301-spaces-sunsetting-faq\">here</a>.</p>\n<h1><a name=\"specification-2\" class=\"anchor\" href=\"#specification-2\"></a>Specification</h1>\n<p>This proposal seeks to indefinitely suspend all off-chain and administrative operations associated with the Spaces program. Specifically, this proposal overwrites the SIPs <a href=\"https://forum.rare.xyz/t/establishing-space-race-curation-parameters-governance-methods-and-procedures/286\">Establishing Space Race Curation Parameters, Governance Methods, and Procedures</a> to suspend the admission of spaces via the Space Race and <a href=\"https://forum.rare.xyz/t/sip-ill-take-the-omakase/693\">I’ll Take the Omakase</a> to suspend the admission of spaces by SR Labs and DAO Council appointment. However, we do not propose any changes to the existing onchain smart contracts related to the Spaces Program.</p>\n<h1><a name=\"benefits-3\" class=\"anchor\" href=\"#benefits-3\"></a>Benefits</h1>\n<ul>\n<li>Provide artists and collectors a more consistent, easier to navigate platform experience</li>\n<li>Development resources can be channeled to other areas more likely to improve the user experience and increase DAO revenue</li>\n<li>Replace siloed Spaces with the much simpler concept of <a href=\"https://help.superrare.com/en/articles/9368645-how-to-use-splits-for-collaborations\">Splits</a> – the ability for anyone to collaborate and support artists for a sale split</li>\n<li>Space contracts remain open and accessible, so anyone can build bespoke frontends for Spaces and reboot the gallery network concept in the future</li>\n</ul>\n<h1><a name=\"drawbacks-4\" class=\"anchor\" href=\"#drawbacks-4\"></a>Drawbacks</h1>\n<ul>\n<li>The primary drawback is the discontinuation of the SR Labs hosted Spaces UIs, necessitating a change in workflow for Space operators. However, Space operators (and anyone else) can now take advantage of <a href=\"https://help.superrare.com/en/articles/9368645-how-to-use-splits-for-collaborations\">Splits</a>, in order to collaborate with creators and earn upside in exchange for helping sell artworks.</li>\n</ul>\n<h1><a name=\"proposal-execution-5\" class=\"anchor\" href=\"#proposal-execution-5\"></a>Proposal Execution</h1>\n<p>Upon execution of this proposal:</p>\n<ul>\n<li>No further space Operators shall be registered via Space Race or Omakase appointment, unless overwritten by a future proposal.</li>\n<li>No changes shall be made to the smart contracts underpinning the spaces program at this time.</li>\n</ul>\n<h1><a name=\"further-considerations-discussion-6\" class=\"anchor\" href=\"#further-considerations-discussion-6\"></a>Further Considerations &amp; Discussion</h1>\n<p>One potential opportunity that came up in community discussions is the possibility of a developer grant to build a refreshed version of Spaces as a 3rd party or community initiative. We’d be happy to discuss this further and provide support if strong interest and the right fit for the project arises.</p>\n<p>If you have questions about what implementation of this proposal looks like from a near term product perspective, please review <a href=\"https://help.superrare.com/en/articles/9939301-spaces-sunsetting-faq\">this FAQ</a> outlining implications for artists, operators and collectors, and drop comments below.</p>\n<p>Thank you!</p>","url":"https://forum.rare.xyz/t/sip-suspend-operations-related-to-the-spaces-program/1601","status":"space-race"},{"id":1552,"t":"SIP|2024 Updates to the MSA between RareDAO Foundation and SuperRare Labs","d":"2024-07-02T16:34:21.422Z","c":"<ul>\n<li>Author: <strong>Lexi Caffrey (SuperRare Labs)</strong></li>\n<li>Status: <strong>Proposed</strong></li>\n<li>Type: <strong>Treasury Management</strong></li>\n<li>Implementer: <strong>RareDAO Governance Council &amp; RareDAO Foundation</strong></li>\n<li>Sponsor(s): TBD</li>\n<li>Created Date: <strong>July 2, 2024</strong></li>\n</ul>\n<p><strong>Summary and Motivation</strong> - The current Master Service Agreement (MSA) between the RareDAO (DAO) and SuperRare Labs (SRL), established in <a href=\"https://snapshot.org/#/superraredao.eth/proposal/0xf84ed27aa4583d7d5b7573842ee142297c2bdb8b5c943f23955a90e1124452f7\" rel=\"noopener nofollow ugc\">SIP-11</a>, is up for renewal in August and needs to be changed. This proposal moves to update the payment terms in the MSA to ensure that SRL is properly compensated for the work it does on behalf of the DAO. This SIP proposes that we change the terms from one based on DAO fees to one based on expenses billed.</p>\n<p><strong>Specification</strong> - The MSA established in <a href=\"https://snapshot.org/#/superraredao.eth/proposal/0xf84ed27aa4583d7d5b7573842ee142297c2bdb8b5c943f23955a90e1124452f7\" rel=\"noopener nofollow ugc\">SIP-11</a> allows for SRL to invoice the DAO monthly for its services plus a 15% service charge along with its relevant expenses. However, when the DAO’s monthly revenue is lower than SRL’s accrued services and expenses, then SRL is only able to invoice the DAO for 85% of monthly revenue. When the original MSA was signed this was a mutually beneficial agreement, however the market has changed quite a lot and this no longer makes economic sense. Given that the MSA is up for renewal in August, we recommend that the section limiting invoices to 85% of revenue be removed from the MSA and that the service charge be reduced from 15% to 10% to provide an equitable agreement for both parties. This aligns incentives between the DAO and the most active service provider to ensure continued development of the project.</p>\n<p><strong>Benefits</strong> - SRL, the DAO’s largest service company, would be in a more stable financial position and more freedom to continue to improve its infrastructure and features for the DAO and the community.</p>\n<p><strong>Drawbacks</strong> - The DAO treasury could be paying out more money each month to SRL.</p>\n<p><strong>Outcomes</strong> - Continued growth of the DAO, protocol, and network as a whole.</p>","url":"https://forum.rare.xyz/t/sip-2024-updates-to-the-msa-between-raredao-foundation-and-superrare-labs/1552","status":"treasury-management"},{"id":1468,"t":"[SIP-20] Add oSnap to RareDAO","d":"2024-04-09T12:36:38.955Z","c":"<ul>\n<li>Author: <strong>Bobby &amp; Alex (UMA / oSnap team)</strong></li>\n<li>Status: <strong>Sponsored</strong></li>\n<li>Type: <strong>Governance</strong></li>\n<li>Implementer: <strong>RareDAO Governance Council</strong></li>\n<li>Sponsor(s): <a class=\"mention\" href=\"/u/thomasbahama\">@ThomasBahama</a></li>\n<li>Created Date: April 9th, 2024</li>\n<li><a href=\"https://forum.rare.xyz/t/rfc-explore-onchain-execution-tools-for-snapshot-proposals/1460\">Request for Comment</a></li>\n<li><a href=\"https://snapshot.org/#/superraredao.eth/proposal/0x9223ec092ea557cd4dbd13db3410ac6954e5e7b20d7fa18eb353a10347b66383\" rel=\"noopener nofollow ugc\">Snapshot Vote</a></li>\n</ul>\n<h3><a name=\"title-1\" class=\"anchor\" href=\"#title-1\"></a>Title</h3>\n<p>Add oSnap to RareDAO</p>\n<h3><a name=\"summary-2\" class=\"anchor\" href=\"#summary-2\"></a>Summary</h3>\n<p>We propose adding oSnap, a governance tool developed by UMA, to the SuperRare Safe to allow for automatic onchain execution after successful Snapshot votes.</p>\n<h3><a name=\"abstract-3\" class=\"anchor\" href=\"#abstract-3\"></a>Abstract</h3>\n<p>Adding oSnap streamlines the execution of governance decisions, brings a new layer of efficiency and reliability to Rare DAO. This requires minimal effort and no disruption to existing DAO governance processes. UMA even covers the onchain execution costs for every oSnap proposal.</p>\n<p>oSnap secures over $800M for treasuries including CoW Protocol, Across, Connext and Shapeshift. A dashboard of all oSnap users can be viewed <a href=\"https://dune.com/risk_labs/osnap-total-value-secured\" rel=\"noopener nofollow ugc\">here</a>. oSnap was built by UMA, an experienced leader in optimistic verification. UMA’s optimistic oracle currently secures $1.5B of TVS across bridges, prediction markets and governance tools.</p>\n<h3><a name=\"motivation-4\" class=\"anchor\" href=\"#motivation-4\"></a>Motivation</h3>\n<p>Adding oSnap decentralizes the execution and empowers RARE holders by enabling tokenholders to govern how the SuperRare Safe funds are allocated. Due to SuperRare funds being in a Safe and SuperRare having an active Snapshot space, adding oSnap requires minimal effort and no disruption to existing DAO governance systems.</p>\n<h3><a name=\"specification-5\" class=\"anchor\" href=\"#specification-5\"></a>Specification</h3>\n<p>oSnap is a module that is added to a Safe with rules on how to evaluate a Snapshot proposal. oSnap Safe app lets you add oSnap to your Snapshot space and Safe in a few minutes with no developer time required. A video demonstration of the oSnap Safe App can be viewed <a href=\"https://docs.uma.xyz/developers/osnap/osnap-quick-start\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<p>Once enabled, Snapshot proposals related to the distribution of funds from SuperRare can include transaction data with the proposal. After a successful Snapshot vote, the transaction is put onchain and verified by UMA’s optimistic oracle before being executed by the Safe. There will be no changes to the SuperRare treasury or proposals for treasury distributions or social votes relating to governance, removing a director, etc.</p>\n<p>The updated Snapshot flow for proposals that include grant distributions would be:</p>\n<ul>\n<li>An oSnap enabled Snapshot proposal is created. This process is the same as a normal Snapshot proposal with the addition of transaction data that will be verified and executed if the proposal passes. The Snapshot transaction builder is specifically designed to make it easy to create and verify transaction data for token transfers.</li>\n<li>RARE holders vote on the proposal like any other SuperRare Snapshot proposal</li>\n<li>If RARE holders approve the proposal by vote, any address can post a bond (2 WETH) for a challenge period (1 to 3 days) and propose to execute the transactions onchain. UMA has implemented a bot that validates proposals (vote passed, meets min voting period/quorum) and posts the bond for DAOs along with covering gas costs for execution (there are no fees to use oSnap).</li>\n<li>If no dispute arises about the proposal’s accuracy during the challenge period, the transactions can then be executed.</li>\n<li>In case of a dispute, the proposal is not executed. UMA token holders vote to resolve the dispute, with the correct party rewarded from the opposing party’s bond. This bonding and dispute mechanism punishes incorrect proposers and disputers and incentivizes honest disputes. Any proposal that was incorrectly disputed can be re-proposed to the oracle for execution without requiring revoting. It is important to note, the dispute resolution decided by UMA token holder votes are not deciding if the transactions can be executed or not, only the bond allocation between the proposer and disputer.</li>\n</ul>\n<p>Here are examples of where oSnap would have streamlined the process:</p>\n<ul>\n<li><a href=\"https://snapshot.org/#/superraredao.eth/proposal/0x70690219269689ea5fccb94b1f315a69e711a9881bdf8db215d58b6a7e2cb7e5\" rel=\"noopener nofollow ugc\">[SIP-15][Ecosystem-funding] Proposal for SuperRareDAO to Fund Ongoing Network Engagement Rewards</a></li>\n<li><a href=\"https://snapshot.org/#/superraredao.eth/proposal/0xe8b93f8e5982cf4e43e30e02beadd3220b32cc7e9027d84337743e09803d8729\" rel=\"noopener nofollow ugc\">[SIP-17][Ecosystem-funding] Proposal to Renew SIP-7 With Two Modifications</a></li>\n</ul>\n<p>UMA created and maintains oSnap as a public good with no implementation or usage fees because we believe decentralized governance tools are critical to the entire Web3 ecosystem. Since UMA is already running robust monitoring across all of our optimistic oracle integrations and can recycle the bonds posted, the additional costs associated with these services are negligible and it is sustainable to continue providing this service for DAOs. If any changes were to be made in the future, we are committed to having existing DAOs not face any changes (aka be “grandfathered in”).</p>\n<h3><a name=\"benefits-6\" class=\"anchor\" href=\"#benefits-6\"></a>Benefits</h3>\n<p>The benefits of SuperRare adopting oSnap are:</p>\n<ul>\n<li>oSnap enables RARE voting to govern how SuperRare funds are allocated and remove the reliance on the Safe multi-sig signers.</li>\n<li>Transaction payloads included in proposals that are approved by voters are trustlessly and permissionlessly executed which increases transparency and decentralization.</li>\n<li>Automatic transaction execution by UMA bots is faster than waiting for multi-sig signers along with the bot paying the gas costs for execution. The gas cost of the transaction execution is paid for by these bots instead of the multi-sig signers.</li>\n<li>The UMA team is continuously making frontend improvements as per user feedback and improving open source monitoring infrastructure for oSnap.</li>\n</ul>\n<p>UMA has also focused significant resources on monitoring efforts:</p>\n<ul>\n<li>The same bot that proposes and executes transactions also automatically disputes inaccurate proposals if the following criteria are not met:\n<ul>\n<li>The proposed onchain transactions match the transactions that were approved in the Snapshot proposal</li>\n<li>The Snapshot proposal passed with the minimum parameters specified (majority in favor, meets minimum voting period and quorum)</li>\n<li>The proposal follows the strategy specified in the Snapshot space.</li>\n</ul>\n</li>\n<li>Proposals are included in the UMA Oracle UI (<a href=\"https://oracle.uma.xyz/\" rel=\"noopener nofollow ugc\">https://oracle.uma.xyz/</a>) which is the same interface used by disputers verifying and disputing for other third-party integrations (Polymarket, Sherlock, Cozy, and other oSnap integrations).</li>\n<li>UMA sponsors a verification program, that pays UMA community members to verify all optimistic oracle assertions So when any transactions are proposed through oSnap, a Discord ticket is automatically created and an experienced verifier from the UMA community completes a multi-step verification process that focuses on areas such as the transaction payload matching the intent of the proposal, verifies transactions do not include interactions with malicious contracts, etc.</li>\n</ul>\n<h3><a name=\"drawbacks-7\" class=\"anchor\" href=\"#drawbacks-7\"></a>Drawbacks</h3>\n<p>While oSnap has been audited by Open Zeppelin, as with any system, there may be unforeseen vulnerabilities.</p>\n<h3><a name=\"outcome-8\" class=\"anchor\" href=\"#outcome-8\"></a>Outcome</h3>\n<p>A successful implementation of oSnap can be tracked by the reduced effort of multisig signers required to execute payloads on relevant proposals that require transaction payloads.</p>\n<h3><a name=\"vote-9\" class=\"anchor\" href=\"#vote-9\"></a>Vote</h3>\n<p>For - Formalizes the community is “for” adding oSnap to the SuperRare Safe.<br>\nAgainst - Formalizes the community is “against” adding oSnap to the SuperRare Safe.</p>","url":"https://forum.rare.xyz/t/sip-20-add-osnap-to-raredao/1468","status":""},{"id":1358,"t":"SIP | Fund Ongoing Network Engagement Rewards","d":"2023-06-16T21:49:47.104Z","c":"<ul>\n<li>Author: <strong>Kyle Olney, COO @ SuperRare Labs</strong>\n</li>\n<li>Status: <strong>Approved</strong>\n</li>\n<li>Type: <strong>Governance</strong>\n</li>\n<li>Implementer: <strong>RareDAO Governance Council</strong>\n</li>\n<li>Sponsor(s): Pindar Van Arman &amp; John Crain</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/868174870389878865/1121083298609901658\" class=\"inline-onebox\">Discord</a>\n</li>\n<li>Created Date: 06/16/23</li>\n</ul>\n<p><strong>Summary:</strong> Allocate ~<strong>45M RARE</strong> to fund network participation incentive programs</p>\n<p><strong>Abstract:</strong> The development of network participation incentive programs that reward active users for their continued patronage are an intelligent way to: i.) stimulate overall market activity, ii.) drive engagement &amp; adoption of features like staking, and iii.) continue broadening the overall distribution of the RARE token - particularly during the current bear market</p>\n<p><strong>Motivation:</strong> The August 2021 airdrop remains the only large-scale token distribution event executed by the DAO treasury thus far. Many new artists + collectors have become active stakeholders in the SuperRare ecosystem over the last 2yrs who should be rewarded for their continued loyalty and engagement.</p>\n<p>Furthermore, a pronounced slowdown in artist + collector activity during the bear market (combined with the release of new products that would benefit from fiscal stimulus, like staking) make it both strategic &amp; timely to develop rewards programs that can leverage treasury resources for the benefit of stimulating market activity in a counter-cyclical fashion.</p>\n<p><strong>Specification:</strong> Following the adoption of this proposal, the RareDAO Governance Council will: i.) dedicate 40m RARE from the community treasury to an allocated pool whose purpose will be to fund user rewards, ii.) be officially authorized to implement one or many programs to reward active users of the SuperRare marketplace &amp;/or Staking contracts as a minor DAO action, and iii.) re-allocate the ~4.8M in unclaimed RARE from the Aug '21 airdrop for the same purpose.</p>\n<p>SuperRare Labs and the RareDAO Foundation will provide guidance to the Governance Council as needed to facilitate the design, implementation or distribution contemplated by any such program that may be developed - whether based on historical or prospective user engagement data.</p>\n<p>These funds will remain allocated for the continued promotion of user engagement rewards subject to authorization by the Governance Council.</p>\n<p><strong>Benefits:</strong> The allocation of these funds should i.) reward new users of the platform since the Aug '21 airdrop for their contributions to the network, ii.) further incentivize active users of the platform for their continued loyalty, iii.) incentivize new market activity from all users, and iv.) stimulate further adoption of the staking protocol if it is adopted by the network</p>\n<p>By developing user rewards programs that incentivize continued engagement, we can create a positive flywheel or virtuous feedback loop that benefits the SuperRare Network and can serve as an important counter-cyclical fiscal stimulus during periods of weakened market activity.</p>\n<p><strong>Drawbacks:</strong> The allocation of these tokens to fund network participation incentives means they cannot be allocated toward other programs. It is further possible that participation incentives like those contemplated by this proposal may be ineffective for the intended purpose of stimulating increased levels of market activity.</p>\n<p><strong>Outcomes:</strong> Upon passage, the Governance Council will earmark 45m tokens (40m from the normal treasury + 4.8m unclaimed from the original airdrop) to fund various programs as needed to incentivize ongoing network participation from active users of the SuperRare marketplace &amp;/or staking protocol (should it ultimately be adopted by the network).</p>","url":"https://forum.rare.xyz/t/sip-fund-ongoing-network-engagement-rewards/1358","status":"protocol-development, treasury-management, rare, staking"},{"id":1421,"t":"[SIP] Establish an Annual Budget for the RareDAO Foundation","d":"2023-12-01T19:59:32.250Z","c":"<ul>\n<li>Authors: <strong>Brennan Mulligan (DAO Program Manager @ SuperRare Labs), John Crain (CEO @ SuperRare Labs), Jonathan Perkins (CPO @ SuperRare Labs)</strong>\n</li>\n<li>Status: <strong><a href=\"https://snapshot.org/#/superraredao.eth/proposal/0x396590e369632215067e5721bae28ff6f255e84f3f930be2182c7542768bd1f6\">Approved</a></strong> <img src=\"https://forum.rare.xyz/images/emoji/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\">\n</li>\n<li>Type: <strong>Treasury Management</strong>\n</li>\n<li>Implementer: <strong>RareDAO Governance Council &amp; RareDAO Foundation</strong>\n</li>\n<li>Sponsor(s): <a class=\"mention\" href=\"/u/flakoubay\">@flakoubay</a>\n</li>\n<li>Link to Request for Comment: <strong><a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a></strong>\n</li>\n<li>Link to Temperature Check Poll: <strong><a href=\"https://discord.com/channels/666318003972997136/868174870389878865/1180253675873108140\" class=\"inline-onebox\">Discord</a></strong>\n</li>\n<li>Created Date: <strong>12/01/2023</strong>\n</li>\n</ul>\n<p><em>Note: This proposal is a followup to <a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a>, which we recently posted. It contains an outline of what we believe the DAO can and should focus on, as well as some short term steps we can take to get there. There are two other proposals stemming from the request for comment: <a href=\"https://forum.rare.xyz/t/sip-2024-governance-council-compensation/1420\">[SIP] 2024 Governance Council Compensation</a> and <a href=\"https://forum.rare.xyz/t/sip-consolidate-branding-of-the-protocol-and-dao/1419\">[SIP] Consolidate Branding of the Protocol and DAO</a>.</em></p>\n<p><em>Each of these proposals will be open for public comment until December 13th, at which point amendments will be made based on feedback. Each proposal which receives council sponsorship will go to Snapshot for voting starting on December 15th and ending on December 22nd.</em></p>\n<h1>\n<a name=\"background-motivation-1\" class=\"anchor\" href=\"#background-motivation-1\"></a>Background &amp; Motivation</h1>\n<p>In addition to forming the council at the DAO’s inception, the RareDAO Foundation was created to serve as a legal entity for the DAO, ensuring regulatory compliance and liability protection for token holders and DAO contributors alike. As we have developed processes which gradually offload responsibility from SuperRare Labs onto the Council and DAO contributors, the importance of the Foundation’s role as a vehicle for progressive decentralization has increased. A key theme over the course of the last year has been developing “operational sovereignty”, that is, the ability of the RareDAO Foundatoin to operate with greater independence of SuperRare Labs and opening the door for decentralization opportunities through things like the grants committee and expanding role of the DAO council. A logical continuation of this is for the Foundation to have its own independent budget, which increases transparency in overhead and staffing costs, and allows for DAO-dedicated resources within SRL to begin a gradual transition into full-time work directly for the DAO.</p>\n<p>Details about the rules that govern the relationship between the RareDAO Foundation, the community, and the governance council can be found in the <a href=\"https://www.notion.so/superrare/The-SuperRare-DAO-Council-By-Laws-Public-1700e3252b73469b820fdbb2c132e88c?pvs=4\">community approved by-laws</a>. Further insight into specific steps the DAO Council, Foundation, and SuperRare Labs have taken to increase operational sovereignty can be found in the <a href=\"https://superrare.notion.site/DAO-Council-Proposals-Public-9c2a5ec1d55e47f49f49c6a158ecb27e?pvs=4\">public log of internal council decisions</a>.</p>\n<h1>\n<a name=\"specification-2\" class=\"anchor\" href=\"#specification-2\"></a>Specification</h1>\n<p>We propose that an annual budget be established for the Foundation, which will give its Director and the DAO Council more autonomy to perform work independent of SuperRare Labs. A primary initial focus will be identifying work currently being performed within SRL that primarily concerns DAO Operations and transferring it to the foundation, making the areas of responsibility for each entity clearer, and opening the door for further decentralization. In addition, this will create more transparency around existing overhead such as corporate costs and operational expenses. The Foundation Director’s recommendation for the first annual budget, which will be accompanied by a 6-month transparency report, is provided in the below table. Upon passage of this proposal, the funds required for this budget will be transferred in a lump sum to the Foundation’s existing <a href=\"https://app.safe.global/home?safe=eth:0xec00C25234B89a0c9B8Bba81Dd18636b1d5ebCEb\">operating expense account multi-sig</a> from the DAO treasury. This multisig is composed of the DAO Council (serving as a single signer), the foundation director, the foundation accountant, and one appointed representative of the council (currently Brennan Mulligan, DAO Program Manager @ SRL).</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Category</th>\n<th>Amount</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Corporate Expenses (Director, Annual Fees, Supervisor)</td>\n<td>$50,000</td>\n</tr>\n<tr>\n<td>Employees / Contractors (DAO Ops &amp; Protocol Development)</td>\n<td>$150,000</td>\n</tr>\n<tr>\n<td>Employees / Contractors (Marketing &amp; Community Management)</td>\n<td>$150,000</td>\n</tr>\n<tr>\n<td>OpEx &amp; Service Providers (Gsuite, Slack, Hats Protocol)</td>\n<td>$50,000</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td><strong>$400,000</strong></td>\n</tr>\n</tbody>\n</table>\n</div><h1>\n<a name=\"benefits-3\" class=\"anchor\" href=\"#benefits-3\"></a>Benefits</h1>\n<p>Currently, the foundation pays many of its expenses through the MSA with SuperRare Labs. This is a convoluted process which increases the Foundation’s dependence on a centralized entity, rather than having a more direct relationship with the DAO Council. Since establishing the Foundation expense account, this has improved, but that account cannot accommodate anything more than de minimis transactions. Passing this proposal will allow for a more direct and all encompassing relationship between the DAO Council and RareDAO Foundation, allowing them to effectively operate without oversight or involvement from SuperRare Labs. Removing this operational overhead from the relationship between SRL and the DAO will increase opportunities for real collaboration while decreasing unnecessary cost and effort in maintaining a suboptimal process. Allowing the Foundation to directly engage a small number of full time contributors will further amplify this by creating the possibility for work to be consistently and reliably be performed outside of SRL, increasing the censorship resistance and credible neutrality of Foundation and DAO Council operations.</p>\n<h1>\n<a name=\"drawbacks-4\" class=\"anchor\" href=\"#drawbacks-4\"></a>Drawbacks</h1>\n<p>While there is significant efficiency to be gained by allowing a degree of discretionary spending within the Foundation, this does introduce the need for transparency and accountability. In many DAOs, Foundation spending can quickly grow out of control and it can often be difficult for the community to track where the money is going and maintain oversight.</p>\n<p>Maintaining tight feedback loops between the foundation and DAO council during monthly meetings (the agendas for which are publicly available, including any resolutions made during / in-between those meetings) goes a long way towards mitigating this. The council will have ample opportunity to inquire into Foundation decision making and object to transactions which they feel are out of scope or problematic. Additionally, the Foundation Director has committed to releasing a 6-month transparency report to update the community half-way through the year, demonstrating progress and rate of spend against that year’s budget.</p>","url":"https://forum.rare.xyz/t/sip-establish-an-annual-budget-for-the-raredao-foundation/1421","status":"treasury-management"},{"id":1420,"t":"[SIP] 2024 Governance Council Compensation","d":"2023-12-01T19:57:06.260Z","c":"<ul>\n<li>Authors: <strong>Brennan Mulligan (DAO Program Manager @ SuperRare Labs), John Crain (CEO @ SuperRare Labs), Jonathan Perkins (CPO @ SuperRare Labs)</strong>\n</li>\n<li>Status: <strong><a href=\"https://snapshot.org/#/superraredao.eth/proposal/0x8b41d8a315f8d694f165b4e7602d6c10f499b417bf4f92b7827592c3cdc5b316\">Approved</a></strong> <img src=\"https://forum.rare.xyz/images/emoji/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\">\n</li>\n<li>Type: <strong>Treasury Management</strong>\n</li>\n<li>Implementer: <strong>RareDAO Governance Council &amp; RareDAO Foundation</strong>\n</li>\n<li>Sponsor(s): <a class=\"mention\" href=\"/u/mocda_museum\">@MoCDA_Museum</a>\n</li>\n<li>Link to Request for Comment: <strong><a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a></strong>\n</li>\n<li>Link to Temperature Check Poll: <strong><a href=\"https://discord.com/channels/666318003972997136/868174870389878865/1180253197495959703\" class=\"inline-onebox\">Discord</a></strong>\n</li>\n<li>Created Date: <strong>12/01/2023</strong>\n</li>\n</ul>\n<p><em>Note: This proposal is a followup to <a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a>. It contains an outline of what we believe the DAO can and should focus on, as well as some short term steps we can take to get there. There are two other proposals stemming from the request for comment: <a href=\"https://forum.rare.xyz/t/sip-consolidate-branding-of-the-protocol-and-dao/1419\">[SIP] Consolidate Branding of the Protocol and DAO</a> and <a href=\"https://forum.rare.xyz/t/sip-establish-an-annual-budget-for-the-raredao-foundation/1421\">[SIP] Establish an Annual Budget for the RareDAO Foundation</a>.</em></p>\n<p><em>Each of these proposals will be open for public comment until December 13th, at which point amendments will be made based on feedback. Each proposal which receives council sponsorship will go to Snapshot for voting starting on December 15th and ending on December 22nd.</em></p>\n<p><strong>Proposal update:</strong> The snapshot proposal for this SIP was originally posted on December 16th at the same time as <a href=\"https://forum.rare.xyz/t/sip-establish-an-annual-budget-for-the-raredao-foundation/1421\">[SIP] Establish an Annual Budget for the RareDAO Foundation</a>, however it was created with incorrect voting options. As such the proposing author (<a class=\"mention\" href=\"/u/superrarejohn\">@SuperRareJohn</a>) has archived the original proposal and created a <a href=\"https://snapshot.org/#/superraredao.eth/proposal/0x8b41d8a315f8d694f165b4e7602d6c10f499b417bf4f92b7827592c3cdc5b316\">new one</a> with the correct options. Voting for this new proposal will conclude at 5:30 pm ET on December 25th.</p>\n<h1>\n<a name=\"summary-motivation-1\" class=\"anchor\" href=\"#summary-motivation-1\"></a>Summary &amp; Motivation</h1>\n<p>As the RareDAO vision expands and ahead of the RareDAO governance council elections at the beginning of next year, we believe it is prudent to assess whether members of this council should be compensated to perform the work required for the DAO to function. Rather than pass a simple “yes / no’’ proposal, members of the current council suggested that we present multiple options for community consideration: one with no compensation, one with less compensation, and one with more compensation. Council members perform work, and we believe this work should be paid as long as the community agrees on the final decision.</p>\n<p><em>Note: This section was updated on Dec. 5th to improve readability.</em></p>\n<h1>\n<a name=\"background-2\" class=\"anchor\" href=\"#background-2\"></a>Background</h1>\n<p>When the DAO was initially formed two years ago, a council of 7 respected community members was appointed to steward the treasury, control access to protocol upgrades, and oversee the process of progressive decentralization. Since then, the council has established robust bylaws for the council and foundation, established working groups to facilitate operations and community grants, and overseen protocol development from the cultivation of curation staking through a handful of smaller protocol upgrades. Going forward, we believe that a strong council remains critical to the cultivation of wisdom and sound strategy within the DAO and will play a foundational role as we continue to evolve.</p>\n<p>The council controls the <a href=\"https://app.safe.global/home?safe=eth:0x860a80d33e85e97888f1f0c75c6e5bbd60b48da9\">DAO Treasury through a 4 of 7 multi-sig</a>, which contains the undistributed $RARE token supply and the DAO’s ETH and USDC reserves, along with other assets. They also hold protocol upgrade authority, and can modify the foundation bylaws and carry out important administrative functions for the DAO more broadly. They are expected to be on-call for multisig transactions and off-chain votes both to keep the DAO running smoothly and respond to emergency situations. In addition, council members are expected to prepare for and attend monthly meetings, administer the governance process through sponsoring proposals and posting them to snapshot, and contribute to the strategic direction of protocol development and positioning. The powers afforded to the governance council and its individual members are described in the<a href=\"https://www.notion.so/superrare/Council-Member-By-Laws-Public-22b6f1814dee4c3bb1763bbbaf513537\"> RareDAO Foundation Council By-Laws</a>, which can only be modified through community proposal or unanimous council vote. A log of all proposals brought before the council is available publicly in this <a href=\"https://superrare.notion.site/DAO-Council-Proposals-Public-9c2a5ec1d55e47f49f49c6a158ecb27e?pvs=4\">notion repository</a>.</p>\n<p>The council was initially appointed to a two year term, and as such it is time to elect a new council. An election will be held, starting in January, to elect the new council members in a multi-stage process with a round of non-competitive nomination voting in order to become eligible for a final round of ranked choice voting to determine council compensation. This process is inspired by <a href=\"https://discuss.ens.domains/t/how-it-will-work-steward-nominations/9212\">ENS’ system for steward nominations</a>, and more details will be released in the first weeks of January before the process kicks off in earnest. Two existing council members, <a href=\"https://twitter.com/SuperRareChar\">Charles Crain</a> (CTO and cofounder @ SuperRare Labs) and <a href=\"https://twitter.com/flakoubay\">Fanny Lakoubay</a> (art advisor and former Director of Communications @ RadicalxChange), were recently appointed and will stay on to complete their terms and maintain continuity as we go through our first transition of power. As such, the election will decide who takes the remaining 5 seats.</p>\n<h1>\n<a name=\"specification-3\" class=\"anchor\" href=\"#specification-3\"></a>Specification</h1>\n<p>The existing council has generously served on an entirely volunteer basis for over two years, attending monthly meetings, contributing to the SIP process, and hopping on countless sidebar and one-on-one calls. This is real work (though, of course, part time) and should be compensated to incentivize ongoing engagement as well as ensure an equitable environment for contributors. As opportunities for DAO contribution grow, it is important that we carefully examine the role of compensation and accountability in DAO operations, and the council serves as a useful beachhead in this experimentation.</p>\n<p>In this proposal, we present three options for community consideration:</p>\n<ol>\n<li>The new council shall receive no compensation</li>\n<li>The new council shall receive $1,000 per month, paid in $RARE</li>\n<li>The new council shall receive $2,500 per month, paid in $RARE</li>\n</ol>\n<p>Once this proposal is posted to Snapshot, voters will be able to select one of the above options to express their preference. If option 2 or option 3 receive the most votes, the funds needed for the first council term would be sent from the DAO Treasury to the <a href=\"https://app.safe.global/home?safe=eth:0xec00C25234B89a0c9B8Bba81Dd18636b1d5ebCEb\">Foundation’s operating expense account</a> (a 3 of 4 multi-sig composed of the DAO council, foundation director, foundation accountant, and a delegate of the DAO council) where they can be distributed to council members on a monthly basis. This change would only come into effect following the council election which is currently scheduled to begin in January 2024, encompassing multiple stages with a transition of power in February.</p>\n<h1>\n<a name=\"benefits-4\" class=\"anchor\" href=\"#benefits-4\"></a>Benefits</h1>\n<p>We hope that compensating council members will attract the highest quality community members to participate in the election, and ensure continued engagement throughout the council term. While having council compensation denominated in USD (meaning that the quantity of $RARE changes based on market price) decreases short term upside for the council, it does ensure that the incentive remains steady through ups and downs of the market. Due to the council’s critical role in protocol maintenance, security, and treasury management, we believe incentivizing steady contribution over time is of utmost importance.</p>\n<h1>\n<a name=\"drawbacks-5\" class=\"anchor\" href=\"#drawbacks-5\"></a>Drawbacks</h1>\n<p>Having any compensation draws down the treasury and means that there are fewer funds available for other commitments. Due to the significant $RARE balance still held by the DAO, these payouts represent a small portion of total resources available and this program would be sustainable for a long time. We believe the token allocation options presented above are small enough that they would not significantly affect token supply and will not have an impact on other potential programs. An additional consideration is whether the compensation should use RARE or USD as the unit of account. We decided to shape the comp options around USD because of the more stable incentive structure described in the benefits section. However, this also means that the council’s incentives are less directly coupled to the price of the token as they receive the same amount of USD equivalent each month, even if they receive it in the form of $RARE.</p>","url":"https://forum.rare.xyz/t/sip-2024-governance-council-compensation/1420","status":"treasury-management"},{"id":1419,"t":"[SIP] Consolidate Branding of the Protocol and DAO","d":"2023-12-01T19:55:12.374Z","c":"<ul>\n<li>Authors: <strong>Brennan Mulligan (DAO Program Manager @ SuperRare Labs), John Crain (CEO @ SuperRare Labs), Jonathan Perkins (CPO @ SuperRare Labs)</strong>\n</li>\n<li>Status: <strong>Draft</strong>\n</li>\n<li>Type: <strong>Ecosystem Growth</strong>\n</li>\n<li>Implementer: <strong>RareDAO Governance Council &amp; RareDAO Foundation</strong>\n</li>\n<li>Sponsor(s): <strong><a class=\"mention\" href=\"/u/flakoubay\">@flakoubay</a></strong>\n</li>\n<li>Link to Request for Comment: <strong><a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a></strong>\n</li>\n<li>Link to Temperature Check Poll: <strong><a href=\"https://discord.com/channels/666318003972997136/868174870389878865/1180252723376042025\" class=\"inline-onebox\">Discord</a></strong>\n</li>\n<li>Created Date: <strong>12/01/2023</strong>\n</li>\n</ul>\n<p><em>Note: This proposal is a followup to <a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a>, which we recently posted. It contains an outline of what we believe the DAO can and should focus on, as well as some short term steps we can take to get there. There are two other proposals stemming from the request for comment: <a href=\"https://forum.rare.xyz/t/sip-2024-governance-council-compensation/1420\">[SIP] 2024 Governance Council Compensation</a> and <a href=\"https://forum.rare.xyz/t/sip-establish-an-annual-budget-for-the-raredao-foundation/1421\">[SIP] Establish an Annual Budget for the RareDAO Foundation</a>.</em></p>\n<p><em>Each of these proposals will be open for public comment until December 13th, at which point amendments will be made based on feedback. Each proposal which receives council sponsorship will go to Snapshot for voting starting on December 15th and ending on December 22nd.</em></p>\n<h1>\n<a name=\"proposal-update-12152023-1\" class=\"anchor\" href=\"#proposal-update-12152023-1\"></a>Proposal Update (12/15/2023)</h1>\n<p><strong>Due to feedback on the potential impacts of this proposal, we have decided not to bring it to a vote at this time.</strong> While it may be re-proposed by us (or anyone else) in the future, we feel it is important that a greater degree of consensus exist within the community that this is the right move. SuperRare Labs, in cooperation with the DAO, will continue developing Curation Staking and other on-chain functionality under the Rare Protocol brand. However, no changes will be made to the overall branding of the DAO or token until this proposal, or one like it, is brought forward again and approved by the community.</p>\n<h1>\n<a name=\"summary-motivation-2\" class=\"anchor\" href=\"#summary-motivation-2\"></a>Summary &amp; Motivation</h1>\n<p>At present, the branding around the DAO is very SuperRare dependent. This presents some advantages by allowing the DAO to benefit from SuperRare’s name recognition and prestige. But it also limits the scope of the DAO to a particular mental model which revolves around the SuperRare marketplace. In order for the DAO to carve out its own place in the world, we believe that it and all of its properties other than SuperRare should be consolidated under the Rare Protocol brand, which we’ve been piloting since the introduction of Curation Staking earlier this year. Specifically, this proposal aims to:</p>\n<ul>\n<li>Update the token branding on exchanges from “SuperRare” to “Rare Protocol” and a new logo, without changing the ticker ($RARE)</li>\n<li>Update public DAO venues such as the forum and snapshot space to use RareDAO or Rare Protocol branding rather than SuperRare branding</li>\n<li>Update RareDAO Foundation documents to reference “RareDAO” and “Rare Protocol” instead of “SuperRare DAO” and “SuperRare Network”</li>\n</ul>\n<h1>\n<a name=\"background-3\" class=\"anchor\" href=\"#background-3\"></a>Background</h1>\n<p>When the DAO was launched, there was some ambiguity about the relationship between it and SuperRare, both as a brand and as a website. Since May we have been piloting use of the Rare Protocol brand as an umbrella for the new curation staking protocol and existing smart contracts (such as the bazaar marketplace). We believe this has been successful, and the added clarity around the branding of the protocol has highlighted an opportunity for similar changes around the DAO. For additional context on the history of the SuperRare and Rare Protocol brands, please reference <a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">[RFC] Expanding the RareDAO Vision</a>.</p>\n<h1>\n<a name=\"specification-4\" class=\"anchor\" href=\"#specification-4\"></a>Specification</h1>\n<p>There are three primary components to this proposal, as outlined in the summary:</p>\n<p><strong>1. Update token branding</strong><br>\nIf this proposal passes, then SuperRare Labs and the RareDAO Foundation will collaboratively draft and release a press release informing the industry of the token’s new branding. Together, SRL and the RDF will send letters to centralized exchanges, informing them of the change and working directly with their teams to facilitate a timely transition.</p>\n<p><strong>2. Update public DAO venues</strong><br>\nThis is the simplest aspect of this proposal. Any public venues related to the DAO, such as<a href=\"https://forum.rare.xyz\"> https://forum.rare.xyz</a> and the DAO’s snapshot space will have their SuperRare branding replaced with branding specific to RareDAO or Rare Protocol, whichever is most relevant. For the forum, this includes both a change to branding as well as a migration to the<a href=\"https://rare.xyz\"> https://rare.xyz</a> domain, however this will not impact any historical data on the Discourse forum and will not result in a significant interruption of service. In most other venues, the update will be purely visual.</p>\n<p><strong>3. Update RareDAO Foundation documents</strong><br>\n“SuperRare DAO” and “SuperRare Network” are referenced in the Foundation’s bylaws and incorporating documents. If passed, this proposal would authorize the foundation director and DAO council to make any changes required to update these terms. Specific implementation decisions shall be subject to unanimous approval by the council, which is the established process for similar updates to the by-laws.</p>\n<h1>\n<a name=\"benefits-5\" class=\"anchor\" href=\"#benefits-5\"></a>Benefits</h1>\n<p>We believe that this will bring much needed clarity around the fact that the DAO’s ambitions extend far beyond SuperRare and increase our ability to drive adoption of the open data protocol, while still staying true to our roots and honoring the continued connection between the SuperRare marketplace and the underlying protocol. For more details about how this feeds into our larger vision for the DAO, please see <a href=\"https://forum.rare.xyz/t/rfc-expanding-the-raredao-vision/1415\">the RFC this proposal stems from</a>.</p>\n<h1>\n<a name=\"drawbacks-6\" class=\"anchor\" href=\"#drawbacks-6\"></a>Drawbacks</h1>\n<p>It may not be possible to have all exchanges update token branding simultaneously, so while we can perform outreach in a coordinated way, token metadata may be updated on some exchanges more slowly than others. This may lead to some initial confusion, but we are confident that we can educate users through press outreach and our normal marketing channels.</p>","url":"https://forum.rare.xyz/t/sip-consolidate-branding-of-the-protocol-and-dao/1419","status":"ecosystem-growth"},{"id":1382,"t":"SIP| Renew SIP-7","d":"2023-08-25T23:02:28.190Z","c":"<p><strong>Author:</strong> <a href=\"https://twitter.com/Wildfire_DAO\" rel=\"noopener nofollow ugc\">Wildfire DAO</a><br>\n<strong>Status:</strong> <strong><a href=\"https://app.safe.global/transactions/tx?safe=eth:0x860a80d33E85e97888F1f0C75c6e5BBD60b48DA9&amp;id=multisig_0x860a80d33E85e97888F1f0C75c6e5BBD60b48DA9_0xecdd9961fb93d05708d450ad54c2d1071b8374f915295db14166ea2aed188b7b\" rel=\"noopener nofollow ugc\">Implemented</a></strong><br>\n<strong>Type:</strong> Treasury Management<br>\n<strong>Implementor:</strong> Rare DAO Governance Council<br>\n<strong>Sponsor(s):</strong> <a class=\"mention\" href=\"/u/superrarejohn\">@SuperRareJohn</a><br>\n<strong>Created Date:</strong> 08/15/2022</p>\n<p><strong>Summary</strong></p>\n<p>Extend SIP-7 and increase the number of RARE allocated to 40MRARE. Additionally remove the expiration date so prevent the need to extend again next year.</p>\n<p><strong>Motivation</strong></p>\n<p>SIP-7 has expired and it would be helpful for the DAO to be able to continue to engage market makers. Additionally this SIP removes the expiration clause as the DAO will likely wish to continue with these types of engagements moving forward.</p>\n<p>Market making buttresses efficient markets, reduces vulnerability to price swings, and in the case of $RARE – increases opportunities for potential buyers seeking to leverage the utility of of the worlds finest curation token. Some market making measures involving increased $RARE circulation are important for ensuring stable and healthy markets, but not without responsible process and transparent decision making situating the community at the helm.</p>\n<p><strong>Abstract</strong></p>\n<p>This SIP contemplates several methods to improve $RARE liquidity and acts as an ongoing request for comment from the $RARE community to suggest market making measures to improve $RARE liquidity. In the interest of efficiency, this Proposal seeks to establish the Council’s independent authority to enter into transactions with third party market makers and/or liquidity providers subject to procedural and transparency obligations. In the spirit of decentralization, this proposal also acts as a call to the community to suggest more user oriented, trustless forms of liquidity provision.</p>\n<p><strong>Specification</strong></p>\n<p>Up to 40,000,000 $RARE (or equivalent value in ETH or USDC) may be made available for certain liquidity and market making activities designed to improve liquidity for $RARE as identified below.</p>\n<p>Approved Methods of Providing Liquidity</p>\n<ol>\n<li>\n<p>Loan Agreements (including purchase options) with Council-Approved Market Makers</p>\n</li>\n<li>\n<p>Discounted Purchase of $RARE to Council-Approved Market Makers</p>\n</li>\n<li>\n<p>Incentivized Liquidity Mining Program</p>\n</li>\n<li>\n<p>Direct Provision of Liquidity from DAO Treasury</p>\n</li>\n</ol>\n<p>Procedure for Council Approving Transactions Related to this Proposal</p>\n<p>The Council may only enter into, execute, and deploy a subsequent transaction or program fulfilling this Proposal’s purpose and relating to an approved method of providing liquidity if the following conditions are met:</p>\n<ol>\n<li>\n<p>the transaction is approved by an informed consent from a majority of Council;</p>\n</li>\n<li>\n<p>the transaction is approved by independent legal counsel; and</p>\n</li>\n<li>\n<p>the Council provides at least fourteen (14) days public notice before each DAO Treasury transaction performed within the scope of this Proposal</p>\n</li>\n</ol>\n<p><strong>Requests for Proposals</strong></p>\n<p>Up to 5,000,000 additional $RARE shall be set aside for the Council to dedicate to community-originated liquidity improvement proposals passed through the SuperRare Improvement Proposal (”SIP”) procedures. The passage of this Proposal would serve as a request for any community member to propose any program or transaction fulfilling this Proposal’s goals. Such community-originated Proposals must survive the ordinary SIP requirements to qualify for $RARE designated by this Proposal for market making activities. The Council may use any portion of the dedicated funds to incentivize related proposal development.</p>\n<p><strong>Benefits</strong></p>\n<p>Improved liquidity, the potential to further decentralize $RARE holdings, and greater access to the $RARE ecosystem. Establishing a regulatory and community friendly precedent for coordinating market making decisions at the community level.</p>\n<p><strong>Drawbacks</strong></p>\n<p>Regulatory risks associated with market making activities and unpredictable governance/market outcomes associated with increasing the circulating $RARE supply. Empowering the Council to make decisions approved by the DAO pursuant to this Proposal enables flexibility and quick decision making but potentially increases information asymmetries between the Council and Community, which creates certain insider trading or securities risks. Such informational asymmetries should be mitigated as provided in this Proposal, or as otherwise deemed appropriate by the Community or Council.</p>\n<p><strong>Outcomes</strong></p>\n<p>This Proposal will be deemed a success if the Council is able to successfully enter into market making transactions (or implement community-generated and approved proposals) while observing the transparency and notice obligations defined herein. Accordingly, the Council should attempt to disclose material aspects of transactions entered into pursuant to this Proposal to the extent such disclosure doesn’t violate any duties of confidentiality. In order to reduce information asymmetries, the Council should make its best efforts to provide early notice and details about the anticipated aggregate sum of $RARE to be released into the market. The Council should consider nominating or otherwise deferring to community members who can provide technical insights on $RARE markets routinely after market making transactions made pursuant to this Proposal.</p>","url":"https://forum.rare.xyz/t/sip-renew-sip-7/1382","status":"treasury-management"},{"id":1378,"t":"SIP | Deploy RARE Staking to Ethereum Mainnet","d":"2023-08-02T16:05:33.215Z","c":"<ul>\n<li>Authors: <strong>Brennan Mulligan (DAO Program Manager @ SuperRare Labs); Charles Crain (CTO @ SuperRare Labs)</strong>\n</li>\n<li>Status: <strong>Implemented</strong>\n</li>\n<li>Type: <strong>Protocol Development</strong>\n</li>\n<li>Implementer: <strong>RareDAO Governance Council &amp; SuperRare Labs</strong>\n</li>\n<li>Sponsor(s): <a class=\"mention\" href=\"/u/flakoubay\">@flakoubay</a> <a class=\"mention\" href=\"/u/superrarejohn\">@SuperRareJohn</a> <a class=\"mention\" href=\"/u/ntomaino\">@ntomaino</a>\n</li>\n<li>Link to Request for Comment: <a href=\"https://forum.rare.xyz/t/rfc-rare-staking-a-novel-mechanism-for-curation-reputation-and-discovery/1346\">Primary</a>, <a href=\"https://forum.rare.xyz/t/staking-discussion-reward-swap-discount/1364\">Follow Up #1</a>, <a href=\"https://forum.rare.xyz/t/staking-discussion-unstake-burn-fee-percentage/1362\">Follow Up #2</a>, <a href=\"https://forum.rare.xyz/t/staking-discussion-stakee-rewards/1363\">Follow Up #3</a>\n</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/868174870389878865/1136330383730941973\" class=\"inline-onebox\">Discord</a>\n</li>\n<li>Created Date: <strong>08/02/2023</strong>\n</li>\n</ul>\n<h1>\n<a name=\"amendment-august-14th-2023-1\" class=\"anchor\" href=\"#amendment-august-14th-2023-1\"></a>Amendment: August 14th, 2023</h1>\n<p>In order to incorporate community feedback from <a class=\"mention\" href=\"/u/leonardodanft\">@LeonardoDaNFT</a>, the proposal authors have decided to make the following change:</p>\n<ul>\n<li>The unstake burn fee should be set to 0% (previously 1%)</li>\n</ul>\n<p>This allows us to observe the degree to which exploitation actually exists in a live environment, given that we believe gas fees will serve as an adequate disincentive early in the system’s adoption. Further exploration of a dynamic burn fee as proposed by <a class=\"mention\" href=\"/u/leonardodanft\">@LeonardoDaNFT</a> has begun, and may be introduced as a modification of the system in a future proposal if appropriate.</p>\n<h1>\n<a name=\"summary-2\" class=\"anchor\" href=\"#summary-2\"></a>Summary</h1>\n<p>Following the successful deployment and testing of <a href=\"https://alpha.rare.xyz/\">RARE Staking</a> on the Goerli testnet, we propose that the protocol be deployed to Ethereum mainnet, and that the DAO Council claim ownership of all contracts associated with this deployment. In addition, we propose that the Bazaar be updated so that 1% of every sale (taken from the existing 3% network fee) is diverted to the seller’s rarity pool, if one exists.</p>\n<h1>\n<a name=\"motivation-3\" class=\"anchor\" href=\"#motivation-3\"></a>Motivation</h1>\n<p>Provide platform agnostic infrastructure for decentralized curation and the generation of crowd-sourced reputation data at scale, with the primary intent of increasing discoverability and strengthening connections between artists, collectors, and curators. We believe this is a long term project that will shape the future of cryptoart, and that it should be carried out in an iterative and collaborative manner. Having learned many valuable lessons from the <a href=\"https://alpha.rare.xyz/\">alpha prototype</a> deployed to the Goerli testnet, we believe the best course of action is to deploy to the Ethereum mainnet, and connect staking contracts to the bazaar so that we can test the economic and social models in a live environment, ensuring the system as a whole provides value to the community and continues to scale effectively over time.</p>\n<h1>\n<a name=\"background-4\" class=\"anchor\" href=\"#background-4\"></a>Background</h1>\n<p>The mechanism design of the RARE Staking Protocol is described in the <a href=\"https://docs.rare.xyz/rare-staking-whitepaper\">whitepaper</a>, published at the beginning of the alpha test period in which the smart contracts were initially deployed to Goerli for public experimentation, and updated recently to include gas optimizations identified as a result. The current state of the protocol can be viewed in this <a href=\"https://github.com/rareprotocol/core/tree/d6594c052570616b5ba3ce85af264de4955be20e/src/staking\">github repository</a>, which will be deployed to Ethereum mainnet upon the passage of this proposal, though the council has the ability to authorize any final changes prior to the deployment for the purposes of gas optimization and security. The code was initially audited by Quantstamp prior to the launch of the contracts on Goerli, and was recently audited again, following the aforementioned optimizations made during the public testing phase. On both occasions, the audit passed without any major concerns with only minor changes being suggested by the auditors.</p>\n<h1>\n<a name=\"specification-5\" class=\"anchor\" href=\"#specification-5\"></a>Specification</h1>\n<h3>\n<a name=\"part-1-configurable-parameter-values-6\" class=\"anchor\" href=\"#part-1-configurable-parameter-values-6\"></a>Part 1: Configurable Parameter Values</h3>\n<p>In addition to outlining the mechanism design and technical specifications, the whitepaper describes the <a href=\"https://docs.rare.xyz/rare-staking-whitepaper#configurable-parameters\">configurable parameters</a> available within the staking system and a detailed description of the design tradeoffs that should be considered for each. Initial assumptions for these parameter values have held up well under testing during the alpha period. The proposed value for each of the system’s configurable parameters are as follows:</p>\n<ul>\n<li>\n<a href=\"https://docs.rare.xyz/rare-staking-whitepaper#round-countdown-duration\">Round Countdown Duration</a>: 7 days.</li>\n<li>\n<a href=\"https://docs.rare.xyz/rare-staking-whitepaper#bonding-curve-equation\">Bonding Curve Equation</a>: Remains unchanged from the testnet deployment, with coefficient values of a = 2 * 10^28 and b = 10^13.</li>\n<li>\n<a href=\"https://docs.rare.xyz/rare-staking-whitepaper#bonding-curve-equation\">Unstake Burn Fee</a>: Remains unchanged from the testnet deployment, with 1% of tokens each time a user withdraws from a rarity pool being burnt to disincentivize high frequency staking and un-staking <em><strong>(NOTE: following the ammendment on 8/14/23, the unstake burn fee will now be set to 0% upon passage of the proposal)</strong></em>\n</li>\n<li>\n<a href=\"https://docs.rare.xyz/rare-staking-whitepaper#bonding-curve-equation\">Reward Swap Discount</a>: Remains unchanged at 90% of each successful reward swap going to the associated rarity pool and 10% going to the executor of the transaction as compensation for the gas required to facilitate the swap.</li>\n</ul>\n<p>We encourage future protocol contributors and governance proposals to modify these parameters as needed to promote system stability, efficiency, and security based on similar levels of testing and community evaluation.</p>\n<h3>\n<a name=\"part-2-deployment-of-staking-protocol-transfer-of-ownership-7\" class=\"anchor\" href=\"#part-2-deployment-of-staking-protocol-transfer-of-ownership-7\"></a>Part 2: Deployment of Staking Protocol &amp; Transfer of Ownership</h3>\n<p>Upon passage of this proposal, Charles Crain (CTO of SuperRare Labs and RareDAO Council member) or his representative will perform the following steps to deploy the staking protocol and facilitate the transfer of contract ownership to the <a href=\"https://app.safe.global/home?safe=eth:0x860a80d33E85e97888F1f0C75c6e5BBD60b48DA9\">DAO multi-sig</a>:</p>\n<ol>\n<li>Run the <a href=\"https://github.com/rareprotocol/core/blob/main/script/staking/RareStakingDeploy.s.sol\"><code>RareStakingDeploy</code></a> script with updated parameters described in Part 1.</li>\n<li>Transfer ownership of the <code>RarityPoolFactory</code>, <code>RewardAccumulatorFactory</code>, and <code>RareStakingRegistry</code> contracts to the DAO Council multi-sig.</li>\n<li>Complete the process by initiating transactions from the DAO Council multi-sig to claim ownership of the <code>RarityPoolFactory</code> and <code>RewardAccumulatorFactory</code> contracts.</li>\n</ol>\n<p>Once the council signs and executes the claim transactions for RarityPoolFactory and RewardAccumulatorFactory, the DAO will have full and exclusive ownership and upgrade authority over the Staking Protocol.</p>\n<h3>\n<a name=\"part-3-modification-of-the-bazaar-smart-contract-8\" class=\"anchor\" href=\"#part-3-modification-of-the-bazaar-smart-contract-8\"></a>Part 3: Modification of the Bazaar Smart Contract</h3>\n<p>As described in the whitepaper, the RARE Staking system is marketplace agnostic, so long as fees are diverted to stakers and curation data is provided back to the protocol. We have outlined a process by which marketplaces that wish to integrate the RARE staking protocol and compensate stakers can divert said fees to the relevant rarity pool for each sale in the <a href=\"https://docs.rare.xyz/rare-staking-whitepaper#funding-rarity-pools\">“Funding Rarity Pools”</a> section of the whitepaper. Accordingly, we propose that the <a href=\"https://docs.rare.xyz/welcome-to-yaare-protocol/protocol-overview/the-bazaar\">Bazaar</a> (i.e. the collection of smart contracts underpinning RareDAO’s on-chain marketplace and auction house functionality) be updated to support rarity pools in anticipation of staking data’s adoption at the marketplace level.</p>\n<p>In addition to the steps described in Part 2 to deploy the staking protocol smart contracts, upon passage of this proposal Charles Crain or his representative will also perform the following steps to update the bazaar:</p>\n<ol>\n<li>Deploy a new version of <a href=\"https://github.com/rareprotocol/core/blob/main/src/bazaar/SuperRareBazaarBase.sol#L150-L236\"><code>SuperRareBazaarBase</code></a>, which contains updated logic for the auction house and marketplace allowing 1% of each sale (one third of the current network fee) to be diverted to the seller’s rarity pool, if one exists.</li>\n<li>Complete the process by initiating transactions within the DAO multi-sig to point <code>SuperRareBazaar</code> to the updated marketplace and auction house logic.</li>\n</ol>\n<p>Once the Council signs the transactions required to upgrade the Bazaar, the protocol will automatically check if the seller in each transaction has a rarity pool, and if they do, divert 1% of the total sale amount to that rarity pool, with the remaining 2% of the network fee being sent to the DAO treasury as normal.</p>\n<h1>\n<a name=\"benefits-9\" class=\"anchor\" href=\"#benefits-9\"></a>Benefits</h1>\n<p>We believe the web of trust and preference generated by this system will provide powerful tools for the discovery of content and the people who create it, as well as decentralized signals of community support. There are many ways in which these signals could be used by the DAO, such as whitelisting trusted network participants, <a href=\"https://docs.rare.xyz/rare-staking-whitepaper#peer-to-peer-enforcement-of-prosocial-behavior\">incentivizing adherence to artist royalties</a>, and even the <a href=\"https://docs.rare.xyz/rare-staking-whitepaper#reputation-based-incentives\">distribution of treasury assets</a>. If you’d like to dive deeper, we encourage you to read the <a href=\"https://docs.rare.xyz/rare-staking-whitepaper#applications\">“Applications”</a> section of the whitepaper, as well as recent blog posts published by SuperRare Labs describing how staking provides equitable and scalable infrastructure for <a href=\"https://superrare.mirror.xyz/DDjvZEmWuHhgrvloUjWT0nB576Taz432OKss1FgA3rg\">discovery</a>, <a href=\"https://superrare.mirror.xyz/RZr8FPcPuadxVTIyOC5HjBXCWDXluMKF5zj49FgcoBc\">community development</a>, and <a href=\"https://superrare.mirror.xyz/QBlhHKcGIMwz5FCZpw1xzeAmeo0G8yGdT8ntWDpEHp8\">reputation</a>.</p>\n<h1>\n<a name=\"drawbacks-10\" class=\"anchor\" href=\"#drawbacks-10\"></a>Drawbacks</h1>\n<h3>\n<a name=\"gas-fees-11\" class=\"anchor\" href=\"#gas-fees-11\"></a>Gas Fees</h3>\n<p>Because this system is built to accommodate both small and large signals of support, and it was intentionally designed to balance financial and social incentives, long term successful adoption will likely depend on affordable transaction fees. We are confident that the fees are low enough for early adoption, however we encourage future protocol development to further optimize the contracts for gas costs and evaluate scaling solutions that would lower the cost of economic participation in this system .</p>\n<h3>\n<a name=\"static-parameter-definitions-12\" class=\"anchor\" href=\"#static-parameter-definitions-12\"></a>Static Parameter Definitions</h3>\n<p>In an attempt to minimize protocol complexity, we propose that the protocol be deployed initially using a fixed reward swap discount and unstake burn fee. In some community discussions it was raised that this is not optimal because it does not take into account factors unique to each pool or to each staker. However, at this early stage, we are committed to maximizing security and minimizing gas expenditure - and one of the best ways to accomplish both is by limiting complex logic and storage requirements at the protocol level. As further gas optimizations are implemented and ethereum scaling solutions become more viable, we will be in a better position to evaluate more complex protocol functionality.</p>\n<h1>\n<a name=\"proposal-execution-13\" class=\"anchor\" href=\"#proposal-execution-13\"></a>Proposal Execution</h1>\n<p>Upon passage of this proposal, the following shall be resolved:</p>\n<ol>\n<li>SuperRare Labs is authorized to deploy the Rare Staking protocol to Ethereum mainnet as described in Part 1 of the Specification Section.</li>\n<li>SuperRare Labs is compelled to transfer ownership of the <code>RarityPoolFactory</code>, <code>RewardAccumulatorFactory</code>, and <code>RareStakingRegistry</code> contracts to the DAO multi-sig following execution of Resolution 1.</li>\n<li>The DAO Council is compelled to claim ownership of the <code>RarityPoolFactory</code> and <code>RewardAccumulatorFactory</code> smart contracts following the execution of Resolution 2.</li>\n<li>Following execution of Resolutions 1, 2, and 3, the <code>RarityPoolFactory</code>, <code>RewardAccumulatorFactory</code>, and <code>RareStakingRegistry</code> contracts shall be considered components of the DAO’s core protocol as defined in the Community Approved By-Laws, and shall only be upgraded in compliance with the procedures described therein.</li>\n<li>The DAO Council is both authorized and compelled to upgrade <code>SuperRareBazaar</code> to accommodate any changes needed for the diversion of funds from the network fee to the staking protocol following the execution of Resolution 1, as described in Part 3 of the Specification section.</li>\n</ol>","url":"https://forum.rare.xyz/t/sip-deploy-rare-staking-to-ethereum-mainnet/1378","status":"protocol-development"},{"id":702,"t":"SIP | Can the Devs Do Something (RARE)?","d":"2022-04-26T23:09:50.699Z","c":"<ul>\n<li>Author: <strong>Kyle Olney, Director of Product @ SuperRare Labs</strong>\n</li>\n<li>Status: <strong>Implemented</strong>\n</li>\n<li>Type: <strong>Governance</strong>\n</li>\n<li>Implementer: <strong>Contributors, as directed by SuperRare Labs</strong>\n</li>\n<li>Sponsor(s): John Crain</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/939274552251412630/968873391224410142\">Discord</a>\n</li>\n<li>Created Date: <strong>04/15/22</strong>\n</li>\n</ul>\n<p><strong>Summary:</strong> Allocate <strong>5M RARE</strong> to fund developer bounties for ongoing network development activities</p>\n<p><strong>Abstract:</strong> As a modestly sized startup with limited resources - the ability for SRL to parallelize development objectives necessary to accommodate voluminous stakeholder demands is severely limited. Given the competitive landscape and endless product opportunities, we propose the allocation of 5M RARE to fund a pool which will be earmarked for product development bounties that benefit SuperRare Network in its mission of decentralization.</p>\n<p><strong>Motivation:</strong> In Q1, SuperRare Labs was informed by one of its 3rd party software providers (Mirror Labs) that they would be sunsetting their Token Race product effective immediately in Q2. This product is currently used to facilitate the Space Race, SuperRare’s first decentralized curation game. The sudden loss of this product will negatively impact the ability of SuperRare Labs to continue with its mission to decentralize curation of the world’s premier cryptoart marketplace. Engineering bandwidth constraints, combined with a roadmap full of existing development objectives, require that we immediately begin a search for 3rd party contributors who can build a replacement so that the Space Race can continue and SuperRare Labs can keep fulfilling its mission to decentralize control of the network.</p>\n<p><strong>Specification:</strong> Following the completion of product design specs, SuperRare Labs will open a request for proposal (RFP) process, where various developers (whether open source, contract or volunteer) can bid to build + deploy a replacement Token Race product so that the Space Race can continue unimpeded.</p>\n<p>SuperRare Labs will, in consultation with the Governance Council, select the best 3rd party developer as needed to deliver the desired scope of work in a reasonable time-frame and at acceptable cost. After the initial Statement of Work (SOW) is completed, this software will be *open-sourced and made available for ongoing contributions by network participants.</p>\n<p>Excess funds not utilized for the purpose of a Space Race replacement will remain allocated for subsequent development grants as necessary to fund ongoing product development bounties, subject to authorization of the Governance Council.</p>\n<p><strong>Benefits:</strong> The allocation of these funds will i.) allow SuperRare Labs to augment its existing development capabilities in the midst of a historically tight labor market, ii.) prevent discontinuation of the Space Race for an unknown period of time and iii.) set the stage for further community development grants which will multiply the development velocity of SuperRare Network.</p>\n<p>By developing the muscles necessary to manage 3rd party software contributors, we begin the process of decentralizing and open-sourcing core software development assets that can serve as public goods for the SuperRare Network.</p>\n<p><strong>Drawbacks:</strong> The allocation of these tokens to 3rd party development means they can’t be allocated to other programs. SuperRare Labs staff will still need to provide managerial oversight + acceptance testing of work executed by 3rd party developers. Final decision of the winning RFP will likely be decided by SuperRare Labs in consultation with the Governance Council for the sake of expediency, rather than via plenary vote of the DAO.</p>\n<p><strong>Outcomes:</strong> Upon passage, SuperRare Labs will begin the scoping and solicitation of RFPs as needed to deliver the desired product experiences. After delivery of the final SOW, a natively owned product platform will be used to facilitate further Space Races and its code will be *open-sourced for the benefit of ongoing community contributions.</p>\n<p>*<em>To prevent against the cannibalization of treasury resources by competitors who would outsource their product innovation to SuperRare, the Apache 3 / copy-left licensing framework will be applied so that novel intellectual property developed by SuperRare network cannot be misappropriated for commercial purposes without compensation being provided to the community who funded it.</em></p>","url":"https://forum.rare.xyz/t/sip-can-the-devs-do-something-rare/702","status":"protocol-development, space-race"},{"id":819,"t":"SIP | Perform a Token Swap between SuperRareDAO and BottoDAO","d":"2022-06-02T12:03:55.877Z","c":"<p>Author: <strong>choobie, Project Lead at Botto</strong></p>\n<p>Status: <strong>Sponsored | Consensus Passed</strong></p>\n<p>Type: <strong>Governance</strong></p>\n<p>Implementer: <strong>SuperRare DAO</strong></p>\n<p>Sponsor(s): John Crain</p>\n<p>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/939274552251412630/981904461691764766\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Discord</a></p>\n<p>Created Date: <strong>02/06/2022</strong></p>\n<p><strong>Summary:</strong> SuperRareDAO should perform a token swap between SuperRareDAO and BottoDAO to support a mutual partnership around developing artists on SuperRare and diversify one another’s treasuries.</p>\n<p><strong>Abstract:</strong> Botto is a decentralized autonomous artist (DAA), connecting Art (NFT) with Capital (DeFi) and Community (DAO). Botto works in collaboration with a community of stewards who vote on its generated imagery to decide what is art. This community of stewards is collectively known as BottoDAO.</p>\n<p>Since Day 0, SuperRare has been home to Botto’s art and success as a DAA, and its community of collectors have driven it to become an All Time Top-10 artist on SR. Currently, Botto’s artwork proceeds pay for Botto’s costs, including the creative labor of its voters. Botto uses the votes to evolve its aesthetics and develop as an artist over time, with the aim of becoming the first world-renowned DAA. Botto’s decentralized economy of incentives that sustains its autonomy is enabled through the $BOTTO token. The token gives holders the ability to vote and govern Botto.</p>\n<p>This proposes that BottoDAO and SuperRareDAO perform a token swap of their native protocol tokens. Such a token swap would enable both DAOs to continually interact, engage, and align incentives with one another in both an immediate time horizon and beyond.</p>\n<p><strong>Motivation:</strong> SuperRare and Botto are both pursuing missions of progressive decentralization, collective creation, and distributed ownership. Both SR and Botto are motivated to further cultivate decentralized approaches to art.</p>\n<p>Community is central to this - with both DAOs carrying conviction that artists, collectors, curators and participants are central to our paths forward. A token exchange facilitates this conviction, allowing progressive interplay between both DAOs to pursue their aligned missions through mutual governance rights.</p>\n<p>For $RARE holders, this also means directly contributing to, and being rewarded by, training Botto’s development as an artist.</p>\n<p><strong>Specification:</strong><br>\nTechnical specifications include facilitating a one-time transaction on each side of the respective DAO multisigs, where:</p>\n<ul>\n<li>1,000,000 $BOTTO are sent to the SuperRareDAO Treasury Wallet</li>\n<li>The 30-day volume weighted average price is used to determine the equivalent amount of $RARE to be sent to BottoDAO’s Treasury wallet</li>\n<li>This 30-day volume weighted average price is calculated at midnight Eastern Time after the end of each DAO’s respective snapshots</li>\n<li>USD notional value is not considered</li>\n<li>Both DAOs hold the the tokens for a minimum of two (2) years after the swap\n<ul>\n<li>No sale of tokens are permitted until after the two (2) years lockup period</li>\n<li>The two (2) year lockup period begins should both snapshots pass</li>\n<li>Each DAO has the right to acquire the tokens back at the prevailing market price if the other DAO decides to sell after this period, with market price taken at the time of declaring intent from either party.</li>\n</ul>\n</li>\n</ul>\n<p>The wallets to be used for the swap are each DAO’s multisig:</p>\n<ul>\n<li>BottoDAO Treasury Wallet - <a href=\"https://etherscan.io/address/0x35bb964878d7b6ddfa69cf0b97ee63fa3c9d9b49\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Botto: Treasury | Address 0x35bb964878d7b6ddfa69cf0b97ee63fa3c9d9b49 | Etherscan</a>\n</li>\n<li>SuperRareDAO Treasury Wallet - <a href=\"https://etherscan.io/address/0x860a80d33e85e97888f1f0c75c6e5bbd60b48da9\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">SuperRare: Treasury | Address 0x860a80d33e85e97888f1f0c75c6e5bbd60b48da9 | Etherscan</a>\n</li>\n</ul>\n<p>Should both SuperRareDAO and BottoDAO’s proposals pass, a joint press release will be announced at the conclusion of the vote.</p>\n<p>A small quantity of ETH is required to facilitate the token swap transaction for both parties.</p>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>SuperRareDAO helps ensure the Decentralized Autonomous Artist can further cultivate its home on SuperRare, while further exposing itself to Botto’s upside</li>\n<li>Enables SuperRareDAO to participate in Botto’s voting ecosystem</li>\n<li>SuperRareDAO gains exposure and goodwill of the Botto community of artists, collectors, and enthusiasts</li>\n<li>BottoDAO may utilize acquired $RARE tokens to apply and vote on the next Space Race to build out curation of related AI art projects</li>\n<li>Both parties diversify their treasury and bank on the success of their respective DAOs</li>\n<li>Both parties mutually strengthen existing ties with one another, compounding each others’ media exposure and networks</li>\n<li>Both parties are able to contribute to the governance of one another</li>\n</ul>\n<p><strong>Drawbacks:</strong></p>\n<ul>\n<li>A 2 year token lockup for both parties; illiquid treasury funds</li>\n<li>Potential investment risk where $BOTTO may become valueless should Botto fail to maintain and/or innovate its operations.</li>\n</ul>\n<p><strong>Outcomes:</strong></p>\n<ul>\n<li>Straightforward treasury diversification in the form of 1,000,000 $BOTTO</li>\n<li>A new Space Race participant in the form of Botto</li>\n<li>Participation in and governance of Botto’s artistic journey as a decentralized autonomous artist</li>\n</ul>\n<p>Edit: Updated lock up period to two years to better reflect LT commitment as per BEN’s recommendation.</p>","url":"https://forum.rare.xyz/t/sip-perform-a-token-swap-between-superraredao-and-bottodao/819","status":"ecosystem-growth, treasury-management, rare"},{"id":1032,"t":"SIP | For the Culture - SuperRareDAO to Sponsor ComplexCon 2022","d":"2022-09-28T05:02:06.901Z","c":"<p>Author: <strong>thomahawk69, SuperRareCasey</strong></p>\n<p>Status: <strong>Voting concluded - did not reach quorum</strong></p>\n<p>Type: <strong>Ecosystem Growth, Promotion, and Brand &amp; Treasury</strong></p>\n<p>Implementer: <strong>SuperRare Labs and SuperRareDAO</strong></p>\n<p>Sponsor(s): <strong>John Crain ; Pindar Van Arman</strong></p>\n<p>Created Date: <strong>September 28, 2022</strong></p>\n<p>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/939274552251412630/1024688719187419156\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Discord</a></p>\n<p><em><strong>Update: ComplexCon can no longer accommodate SuperRare to be part of the festival. It’s unfortunate, but thank you for everyone’s support!</strong></em></p>\n<p><strong>Summary:</strong><br>\nSuperRareDAO should sponsor <strong><a href=\"https://www.complexcon.com/\" rel=\"noopener nofollow ugc\">ComplexCon 2022</a></strong> for an IRL Activation in the Web3 activation area where Coinbase is the Main/Anchor Sponsor - and SuperRare can take a section to curate a “<em>Phyigital</em>” gallery  (in the TBD area in diagram) with a $RARE bar education section to bring attention and interest into CryptoArt.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://forum.rare.xyz/uploads/default/original/2X/8/8da9202f0c31885667a0748f958961fa07ebb759.png\" data-download-href=\"https://forum.rare.xyz/uploads/default/8da9202f0c31885667a0748f958961fa07ebb759\" title=\"floor plan\"><img src=\"https://forum.rare.xyz/uploads/default/optimized/2X/8/8da9202f0c31885667a0748f958961fa07ebb759_2_550x500.png\" alt=\"floor plan\" data-base62-sha1=\"kdbFKYWL5EgUsAv3SGMCa4MzEAp\" width=\"550\" height=\"500\" srcset=\"https://forum.rare.xyz/uploads/default/optimized/2X/8/8da9202f0c31885667a0748f958961fa07ebb759_2_550x500.png, https://forum.rare.xyz/uploads/default/original/2X/8/8da9202f0c31885667a0748f958961fa07ebb759.png 1.5x, https://forum.rare.xyz/uploads/default/original/2X/8/8da9202f0c31885667a0748f958961fa07ebb759.png 2x\" data-dominant-color=\"F9F9F9\"><div class=\"meta\">\n<svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">floor plan</span><span class=\"informations\">575×522 36.3 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg>\n</div></a></div></p>\n<p><strong>Abstract:</strong><br>\nComplexCon is a curated festival over 2 days that brings together the world’s most influential brands and artists for an immersive experience within art, culture and food. The Web3 activation area offers SuperRare an opportunity to connect with Web3 curious audience to continue to grow the community. SuperRare is on a mission to allow anyone in the world to be an art collector and by participating in this festival - SuperRare will reach an ideal audience of young, forwarding thinking, risk-taking, and cryptoart curious individuals that could potentially be brought onto the SuperRare network.</p>\n<p>This proposal is asking SuperRareDAO to help provide the sponsorship fees to participate in the 2-day event and have the SuperRare Labs team help curate and execute the event that will best engage with the ComplexCon audience.</p>\n<p>For context: in 2021 - <a href=\"https://fewocious.com/complexcon/\" rel=\"noopener nofollow ugc\">Fewocious</a> participated in the event and generated a lot of attention to the cryptoart space, as well as to his brand. The <a href=\"https://opensea.io/collection/fewocious-complexcon\" rel=\"noopener nofollow ugc\">limited edition NFT</a> from the event has a total volume of over 300 ETH on the secondary market and is still being traded to this day.</p>\n<p>SuperRare is made up of a network of talented artists and as a collective, with help from SuperRare Labs, all the artworks put on display will garner attention from the attendees as well as the national media.</p>\n<p><strong>Motivation:</strong><br>\nSuperRare is a marketplace/technology platform - but when the SuperRare brand appears in any art-related events, people get excited. It speaks volume about the SuperRare brand. SuperRare is pursuing progressive decentralization, but it still requires help from the SuperRare Labs team to steer the ship in that direction.</p>\n<p>SuperRare’s superpower is its community - carrying conviction that artists, collectors, and curators can move the chess pieces forward, thus participation in ComplexCon is a no-brainer. As the SuperRare brand gets recognition through this event, the community wins as a whole as the brand gets elevated in the eyes of the participating audience. Hopefully, with this sponsorship, participants of this event will remember the SuperRare name, and become an artist through Spaces or become a CryptoArt collector in the near future.</p>\n<p>In addition to being associated with the iconic event of ComplexCon, SuperRare is also on a mission to revolutionize the economics of human creativity by building a new art market that anyone can access. To achieve this goal, SuperRare must become the foremost digital art collecting platform - and an important step is educating and onboarding new collectors IRL. Having an intimate 1 on 1 experience beyond the typical gallery tradeshow/exhibition is paramount in making the SuperRare-ComplexCon experience an unforgettable event.</p>\n<p><strong>Specification:</strong><br>\n<strong>Ask:</strong> Requesting funds from SuperRareDAO for an IRL Activation space within the Web3 area in ComplexCon. A 10 x 15 ft wall/booth is approximately <strong>USD $20 to $25K</strong> - depending on the design plan, and upwards of <strong>USD $50,000</strong> for both sides of the booth with potential to negotiate a lower price. On the conservative side - all-in cost requested to fund this event is <strong>USD $50,000</strong>.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://forum.rare.xyz/uploads/default/original/2X/2/2b6e5e7962bed3aa20baa3f0ed0c3a1fd47ee287.png\" data-download-href=\"https://forum.rare.xyz/uploads/default/2b6e5e7962bed3aa20baa3f0ed0c3a1fd47ee287\" title=\"Pricing\"><img src=\"https://forum.rare.xyz/uploads/default/optimized/2X/2/2b6e5e7962bed3aa20baa3f0ed0c3a1fd47ee287_2_690x160.png\" alt=\"Pricing\" data-base62-sha1=\"6ccZJSwvop2RpMm38zRmUqQeI9p\" width=\"690\" height=\"160\" srcset=\"https://forum.rare.xyz/uploads/default/optimized/2X/2/2b6e5e7962bed3aa20baa3f0ed0c3a1fd47ee287_2_690x160.png, https://forum.rare.xyz/uploads/default/optimized/2X/2/2b6e5e7962bed3aa20baa3f0ed0c3a1fd47ee287_2_1035x240.png 1.5x, https://forum.rare.xyz/uploads/default/original/2X/2/2b6e5e7962bed3aa20baa3f0ed0c3a1fd47ee287.png 2x\" data-dominant-color=\"A8A8A8\"><div class=\"meta\">\n<svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Pricing</span><span class=\"informations\">1373×319 16.3 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg>\n</div></a></div></p>\n<p>The ideal scenario is to create a memorable experience that participants will take away from the event; either through socials, pictures, interactions, or a POAP.</p>\n<p>Additional costs - provide simple giveaways to event participants (2 tiers of giveaways) - increase brand awareness and activation with day-to-day items (dad hats, shirts, etc.) And a code that give attendees a discount code to purchase swag on our Shop site.</p>\n<p><strong>Tier 1:</strong> Small items: Stickers &amp; POAP - to all attendees<br>\n<strong>Tier 2:</strong> Medium and limited items: One item (depending on cost and design) - to attendees that sign up for a 1-on-1 session with a SR Rep and purchase a piece of CryptoArt</p>\n<p>In order for this event to be successful, and aside from the sponsorship funds - the SuperRare Labs team (will help curate, educate, organize, coordinate, and promote) will need to be involved and be present during the event. The costs of the SuperRare Labs team will be charged back to the SuperRareDAO under the approved MSA <a href=\"https://snapshot.org/#/superraredao.eth/proposal/0xf84ed27aa4583d7d5b7573842ee142297c2bdb8b5c943f23955a90e1124452f7\" rel=\"noopener nofollow ugc\">SIP-11</a>.</p>\n<p><strong>Operational Logistics:</strong><br>\n<strong>Display Partner:</strong> <a href=\"https://www.netgear.com/home/digital-art-canvas/\" rel=\"noopener nofollow ugc\">Meural</a> would be an ideal partner since it is already a DAO Partner and Member and received great feedback at the NY Gallery. Other alternatives include: Samsung or Infinite Objects. Will be finalized and be updated accordingly.</p>\n<p><strong>Design:</strong> The SuperRare Labs team has the best insights into what engages with new audiences through its experience during the 4-month gallery pop-up in NY. The team would be able to design an experience that will generate the best results for the SuperRare brand. <a href=\"https://www.instagram.com/pirovino/?hl=en\" rel=\"noopener nofollow ugc\">Ronnie Pirovino</a>, who helped with the Fewo exhibition in 2021, has offered to help make this a memorable experience for the attendees. Rich Antoniello (founder of Complex Networks and a SuperRare DAO participant) can also provide valuable insights regarding past event Do’s and Dont’s.</p>\n<p><strong>Curation:</strong> The curation team at SuperRare Labs has demonstrated over the years that they can create the best art-programming during various types of exhibitions. Examples include Art Basel Miami in 2021, NFTNYC in 2021 &amp; 2022, LAArt Show 2022, ETHDenver 2022, Venice Biennale 2022, etc. SuperRare Labs also has the relationship with artists that can help create low price point CryptoArt or a POAP for this event to be claimed by participants.</p>\n<p><strong>Representation:</strong> Artists (whose work that will be on display and also participating in the low price point artworks) and select SuperRare Labs team members. GA passes are included as part of the Sponsorship Fee. The SuperRare Labs team that are in attendance will not only be the 1-on-1 representative teaching conference goers how to buy on SuperRare, but also help promote CryptoArt, the culture, and the SuperRare community. Limited to curation, marketing, and sales personnel that are in close proximity/on the West coast.</p>\n<p><strong>Cost:</strong> Depending on the community’s response - suggest going with two (2) L shaped wall and make it a SuperRare “Space” or “Corner” and make it an intimate experience. Approximately <strong>USD $50K (approximately 290,000 $RARE or 38 ETH)</strong>, but could be negotiated down by leveraging SuperRare’s existing brand and relationship with Ronnie Pirovino.</p>\n<p><strong>Activation Recommendation:</strong><br>\nHave SRL personnel on-site to guide conference goers step-by-step demos on buying their first NFT/CryptoArt on SuperRare. Set up like a Genius bar at Apple (”RARE Bar”), where people can schedule 15 min 1 on 1s with a SRL Rep while immersed in CryptoArt from SuperRare on some artistically displayed screens curated by Ronnie Pirovino (suggested by Rich Antoniello, founder of ComplexCon). SuperRare artists can create series of low price point artworks to be released at ComplexCon at the RARE Bar, so new users would just need to pay gas to buy their first cryptoart, while also learning about secondary sales/trades on SuperRare. (ex. Fewo did a free edition NFT last year at ComplexCon which were airdropped/gifted to the first 420 visitors to his activation, still being traded today and over 330ETH in volume on the secondary). This not only helps guide a new user to buy their first NFT on SuperRare but also amplifies the togetherness of the community of artists who participated in the event. There can also be an additional aspect where some $RARE token is airdropped to the first 100 visitors or some number on top of having a couple hundred NFTs bought during the 2 days of ComplexCon.</p>\n<p>Gallery setup could be either a few large screens to make it more immersive or curate many smaller ones in a salon fashion creating the same effect to the visitors while the SuperRare Labs’ team educate the conference attendees on SuperRare and demonstrate the steps needed to purchase CryptoArt.</p>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Continue to relay the message that SuperRare is the go-to place for exceptional CryptoArt</li>\n<li>Brand by association - being next to Coinbase, and other key Web3 players will drive goodwill to the crypto-curious audience</li>\n<li>Less transactional, more personal and informative - longer relationship with SuperRare</li>\n<li>Encourage more people into web3/crypto</li>\n<li>Talent discovery - recruit brand ambassadors and/or potential future employees</li>\n<li>Future brand partnerships - by being involved in ComplexCon, SuperRare can be easily discovered and be the future partners of choice by web3 curious brand that are also in attendance</li>\n<li>Encourage others in the community to put forth event idea similar to this</li>\n</ul>\n<p><strong>Drawbacks:</strong></p>\n<ul>\n<li>This will be the first event directly funded by the SuperRareDAO as a sponsorship - and could result in high costs and low ROI</li>\n<li>Everything is easier said than done - execution of the event is paramount, could potentially fall short and not live up to expectations</li>\n<li>There’s a chance of being overshadowed and getting lost in all other exhibitors at ComplexCon - i.e. big brands with bigger budgets drawing more eyeballs</li>\n<li>All other sponsors had months to plan in advance - SuperRare Labs will have less than 2 months to put this in motion</li>\n</ul>\n<p><strong>Outcomes:</strong></p>\n<ul>\n<li>Monitor social media channels to see the reaction to the SuperRare exhibition during the 2 day event: Increase in social media mentions and tags</li>\n<li>Collect # of attendees + info via sign ups of 1-on-1 sessions (with iPad at the booth)</li>\n<li>Number of successful transactions during the 2 day conference.</li>\n<li>Increased traffic and transactions to the SuperRare website during the event dates</li>\n<li>Sale of artworks on display during exhibition and dates surrounding the event</li>\n<li>More widespread adoption and awareness for CryptoArt (a bit difficult to quantify)</li>\n<li>International exposure to crypto-savvy audience through news outlets/PR</li>\n</ul>","url":"https://forum.rare.xyz/t/sip-for-the-culture-superraredao-to-sponsor-complexcon-2022/1032","status":"ecosystem-growth, rare"},{"id":703,"t":"SIP | Adopt DAO Council By-Laws","d":"2022-04-27T01:14:56.367Z","c":"<p><strong>Title:</strong> Adopt DAO Council By-Laws</p>\n<ul>\n<li>Author: <strong>Emilio Cazares | Former Legal Innovation Counsel at SuperRare Labs</strong>\n</li>\n<li>Status: Approved <a href=\"https://snapshot.org/#/superraredao.eth/proposal/0xa73cb6573872fe91bc1c7ee0711da48d2ef46a672e92c9ec01fa59603f4edd4f\" class=\"inline-onebox\">Snapshot</a>\n</li>\n<li>Type: <strong>Governance</strong>\n</li>\n<li>Implementer: <strong>Governance Council | the RareDAO Foundation</strong>\n</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/939274552251412630/968874905468829707\" class=\"inline-onebox\">Discord</a>\n</li>\n<li>Created Date: <strong>04/26/22</strong>\n</li>\n</ul>\n<h2>\n<a name=\"summary-1\" class=\"anchor\" href=\"#summary-1\"></a><strong>Summary</strong>\n</h2>\n<p>The RareDAO Foundation (the “Foundation”), the non-profit foundation established for the benefit of the SuperRare DAO (the “DAO”), should adopt official By-Laws to more clearly establish the powers and procedures of the DAO Council. <strong>This Proposal is a Draft intended for robust Community discussion and debate. Comments encouraged</strong></p>\n<h2>\n<a name=\"motivation-2\" class=\"anchor\" href=\"#motivation-2\"></a><strong>Motivation</strong>\n</h2>\n<p>Adopting an Official Charter and By-Laws for the DAO Council serves to provide clarity to the community as to the level of the authority, privilege, and responsibilities that accompany Council membership. While the DAO may (and should) experiment with other potential Council models or governance structures in the future, By-Laws should be put in place to afford the community clarity on the powers of the Council, the specific governance procedures and responsibilities the Council must adhere to to in furthering a community-controlled DAO, and to further operationalize the DAO. The By-Laws should be drafted to afford the Community the strongest level of control on decisions affecting the DAO while balancing the need for flexibility at the Council and Foundation level to effectively and efficiently operate the DAO.</p>\n<h2>\n<a name=\"specification-3\" class=\"anchor\" href=\"#specification-3\"></a><strong>Specification</strong>\n</h2>\n<p>This Proposal specification sets forth <strong>a working draft</strong> of example Council By-Laws that the DAO may choose to adopt. The text below is intended to be modified and improved after robust community discusion. The Author will publish all subsequent revision, including redlines, to ensure transparency and consistency with Community’s feedback.  Comments encouraged!</p>\n<ol>\n<li>Relationship Between the RareDAO Foundation &amp; the SuperRare DAO</li>\n</ol>\n<p>The RareDAO Foundation (the “Foundation”) is a non-profit Cayman Island Foundation Company established for the benefit of the SuperRare DAO (the “DAO”) and its decentralized community of users (the “Community”). The Foundation represents the DAO and the Community’s interests in connection with the DAO’s contractual and legal processes, regulatory compliance, decentralized governance, and as otherwise stipulated in the Foundation’s Memorandum of Association (the “MOA”).</p>\n<ol start=\"2\">\n<li>Foundation Director(s)</li>\n</ol>\n<p>The Foundation director(s) (the “Director(s)”) manage the day-to-day affairs of the Foundation in accordance with the Foundation Companies Act of 2017 of the Cayman Islands (the “Act”), the Foundation’s Memorandum of Association, the Foundation’s Articles of Association (the “Foundation Articles”), and these By-Laws. The Foundation shall have at least one (1) Director. Directors must be appointed and confirmed by a supermajority decision of the Council (at least two-thirds of active Council members). Directors may be removed at any time by a supermajority decision of the Council. A Director shall serve for a period of three (3) years from the date appointed and may be reappointed by a majority vote of the Council. The Community, with authority preempting that of the Council, may vote to nominate, confirm, and remove for cause one or more Director(s) through the SuperRare Improvement Proposal (“SIP”) procedures, which are incorporated by reference in these By-Laws. The interim vacancy of a Director for any reason shall be temporarily filled by a Council member or other person nominated by a majority decision of the Council while a new Director is awaiting appointment and confirmation by a super-majority decision of the Council</p>\n<p>Director(s) must be at least 18 years of age and have(i) no disqualifying attributes under Cayman Islands law, (ii) no personal financial insolvency for the past 10 years, (iii) no convictions or guilty pleas for mishandling or embezzlement of funds of any organization, and (iv) have not been involuntarily removed or forced to resign from any directorship, or similar executive or high-level position, within any organization.</p>\n<ol start=\"3\">\n<li>The Council<br>\nThe Council is the ultimate governing body of the Foundation. The Council’s primary purpose is to safeguard the DAO Treasury (the “Community Treasury”) and to effectuate the intent of the Community. The Council also plays a strategic operations, governance, oversight, curation, and coordination role for the DAO. The Council, acting with the Director(s), must ensure that it and the Foundation has sufficient authority, resources, operational capacity, competitiveness, and funding to effectively grow the DAO, meet the Foundation’s obligations under Applicable Law, fulfill the intent of the Community as approved in accordance with the SIP procedures, and to otherwise help fulfill the Foundation’s mission of improving and decentralizing the DAO. Although Council members must act in the best interest of the DAO and the Community, Council members are not corporate fiduciaries of the DAO or Community.</li>\n</ol>\n<p>“Council” means those persons elected by the Community, with the initial Council being those individuals described in the Foundation Articles, and, in the first instance, appointed by the Director(s) and serving for an initial term of twenty-four (24) months or such longer term until the successor Council is appointed. Council members shall not be compensated unless and only to the extent the Community approves a compensation related Proposal pursuant to the SIP process.</p>\n<ol start=\"4\">\n<li>The Council’s Authority</li>\n</ol>\n<p>The Council has the authority to adopt by-laws and policies, appoint or remove Director(s), amend the Foundation’s Articles of Association, and to otherwise authorize the Director(s) to take actions for the benefit of the DAO. Council members may engage in any activity or action necessary to influence the DAO through participation in the SIP process or any other activity expressly or impliedly approved by the Community, including authority expressly granted in these By-Laws. The Council’s primary expression of its decision making is through the DAO multi-signature Treasury smart contract (“the DAO Multi-Sig”), which is collectively controlled by individual authenticated Council members and invoked to ratify or effectuate Community-approved decisions requiring the settlement of transactions on the Ethereum blockchain. An individual Council member’s decision to approve or abstain from approving a DAO Multi-Sig transaction in relation to a Community-approved action does not necessarily signify the respective Council member’s opinion towards the Community-approved action.</p>\n<pre><code>The DAO Multi-Sig wallet is presently a 4-of-7 multi-signature smart contract \tcontrolling the Community Treasury currently located at Ethereum address: \t0x860a80d33E85e97888F1f0C75c6e5BBD60b48DA9  \n</code></pre>\n<p>Each Council member carries equal authority. No individual Council member has the complete authority to execute transactions on behalf of the Foundation or DAO without the required approval from the other Council members, Community, or Foundation Director(s) as provided herein or by the Foundation’s Articles. The Council may establish, delegate authorities and responsibilities to, govern, and appoint Community members into positions on committees, working groups, smart contracts, sub-DAOS, sub-Councils, or other roles or bodies as approved by a supermajority of the Council. Council members may delegate their individual or collective authority to other Community members, upon a majority decision approval by other Council members. In the absence of any controlling authority, Council members must agree by a supermajority decision to conduct activities on behalf of the DAO or Foundation, subject to the Director(s) fiduciary obligations to the Foundation.  By unanimous decision, the Council may expand the number of Council seats and perform all necessary and ancillary technical changes to the DAO Multi-Sig to effectuate the changes to the Council composition.</p>\n<ol start=\"5\">\n<li>\n<p>Responsibility of Individual Council Members<br>\nCouncil members are expected to actively pursue any measure within their authority to further decentralize and improve the DAO. Nominated for their unique abilities and perspectives, Council members are expected to advocate for their individual interests and the interests of Community members. As part of their services to the DAO, each Council member agrees to at least:<br>\nA.\tAdhere to these By-Laws and the governing documents of the Foundation;<br>\nB.\tMonitor, consider, or otherwise stay apprised of Community discussions and Proposals (as defined below) within the official DAO governance forums;<br>\nC.\tDevelop, publish, monitor, incentivize, and consider for sponsorship SIPs, Requests for Comments (“RFCs”), or Requests for Proposals (“RFPs”) published by Community members in accordance with the SIP process;<br>\nD.\tAttend and participate in monthly Council meetings;<br>\nE.\tAttend Emergency Meetings and coordinate Emergency Protocol operations (as defined below);<br>\nF.\tAppoint individuals or organizations into key Foundation roles and into important administrative, Council, governance, engineering, legal, or other roles established by the Council to serve the DAO;<br>\nG.\tExecute Community-approved and authorized transactions from the DAO Multi-Sig as required or requested or required by other Council members, the Foundation, or the Community;<br>\nH.\tRemain an active an involved Council member responsive to needs, demands, and ideas of the Community; and<br>\nI.\tExercise no less than reasonable security measures over the DAO Multi-Sig private keys in accordance with industry security standards.</p>\n</li>\n<li>\n<p>Major DAO Actions Requiring a Proposal and Vote<br>\nIn the absence of an Emergency (as defined below), and unless otherwise approved or authorized by the Community, the following major actions within the Council’s authority (each a “Major DAO Action”, and collectively, the “Major DAO Actions”) may only occur at after:</p>\n</li>\n</ol>\n<p>A.\tThe presentation by a Council member or Community member in writing of a SIP for the Community’s consideration (a “Proposal”) in accordance with the SIP Procedures;<br>\nB.\tA public sponsorship of the Proposal from at least one other (1) Council member who is not an author of the SIP or otherwise recused;<br>\nC.\tThe absence of a Proposal Rejection (as defined below) earlier than three (3) days before the Proposal’s scheduled Community consensus vote;<br>\nD.\tA majority approval by a quorum of Community members during a public vote occurring no earlier that seven (7) days after the first Council member sponsorship;<br>\nE.\tThe satisfaction of all other SIP substantive and procedural requirements, as determined by a majority Council before the final Community consensus vote.</p>\n<p>Major DAO Actions include Proposals relating to following categories: (i) modifying the core SuperRare Protocol (the “Protocol”); (ii) authenticating or creating authority to authenticate Artists, curation nodes, and other Protocol-level participants; (iii) major Foundation transactions (as defined below); (iv) deploying assets from the Community Treasury; and generally (v) performing transactions from the DAO Multi-Sig to effectuate changes to the DAO in the absence of controlling authority. Nothing in this Section shall prohibit the Council to authorize, without fulfilling the ordinary Major DAO Action requirements but with at least a quorum of approving Council members, any emergency action or other activity necessary to preserve the safety, security, or ongoing operation of the DAO, including but not limited to, an imminent threat or vulnerability to the network, Protocol or Community (an “Emergency”). Nothing in this Section shall prohibit the Council to implement a Proposal Rejection at any time where there is a dissenting supermajority of Council members rejecting a Proposal by reason of such Proposal conflicting with the best interest of the DAO or the Community, the Foundation MOA, the Foundation Articles or these By-Laws (“Proposal Rejection”).</p>\n<p>The following non-limiting and illustrative list of actions would ordinarily be considered a Major DAO Action:</p>\n<p>A.\tMaking official contributions, modifications, or deployments of the Protocol;<br>\nB.\tModification of on-chain economic parameters or functionality within the Protocol;<br>\nC.\tReleasing, transferring, promising, dedicating, or selling funds or assets from the DAO Treasury;<br>\nD.\tAuthorizing, whitelisting or granting other permissions relating to a Community member’s minting or curation privileges;<br>\nE.\tAuthorizing individual transactions in excess of $250,000 USD on an annual basis by the Foundation or the Council (a “Major Transaction”);<br>\nF.\tFunding grants (“Grants”) from the DAO Treasury, including, but not limited to Donative Grants (as defined below) and Community Development Grants (as defined below); and<br>\nG.\tAdopting official DAO policies, codes of conduct, Community guidelines, terms &amp; conditions, or governance procedures.</p>\n<ol start=\"7\">\n<li>Minor DAO Actions<br>\nIn the absence of an Emergency or Routine Council Action (as defined below), minor actions with respect to the DAO that are within the Council’s authority (each a “Minor DAO Action”) unless otherwise approved or authorized by the Council or Community, may only occur after:<br>\nA.\tThe presentation by a Council member to the rest of the Council of an internal Proposal and either:<br>\na.\tIf the internal Proposal is discussed at a meeting, an affirmative vote at the meeting by a majority of Council members who are not recused from such vote (Council members who are absent from a meeting of the Council will be deemed to vote “no” in such a vote); or<br>\nb.\tIf the internal Proposal is made in writing (an “Async Proposal”), an affirmative vote by a majority of Council members who are not recused from such vote, within fourteen (14) business days of the Async Proposal being made, by a majority of Council members who are not recused from such vote, but only if a Quorum of at least one-third of the active  Council members (a “Quorum”) is met.</li>\n</ol>\n<p>All Minor DAO Actions within the Council’s authority shall not require any other procedures, but the Council should consider to memorialize and convey its decision-making process to the Community or otherwise involve the Community to the extent that it serves a compelling Community interest to do so. All actions that are not Major DAO Actions are presumably Minor DAO Actions unless otherwise provided herein.</p>\n<ol start=\"8\">\n<li>Emergency and Routine DAO Actions<br>\nUpon a quorum of approving Council members, either in writing or in person, the Council may perform and/or delegate any of the following actions or related ancillary actions without limitation in its sole and absolute discretion without complying any other requirements (each an “Emergency or Routine Council Action”):</li>\n</ol>\n<p>A.\tPerforming or authorizing ongoing network maintenance, administrative or procedural aspects of the DAO, or other ancillary tasks related to the ongoing operations of the DAO;<br>\nB.\tResponding to and performing certain Protocol operations and network security responses in the event of an Emergency;<br>\nC.\tApproving of and funding transactions, ongoing overhead expenses, and miscellaneous operational expenses by the Foundation or DAO less than $100,000 USD (“De Minimis Transactions”) per annum in value provided that, there cannot be more than three (3) of such De Minimis Transactions in a month<br>\nD.\tDetermining and executing implementation details for Community-approved Proposals to the extent not materially and substantially inconsistent with the particulars of the Proposal as approved by the Community;<br>\nE.\tDistributing funds (less than $1,000 USD per Council member per month) to the Community for the limited purpose of incentivizing or rewarding participation in DAO governance;</p>\n<ol start=\"9\">\n<li>The SIP Process</li>\n</ol>\n<p>Community members, including Council members, may create and publish SIPs or related requests for consideration by the Community and the Council. All SIPs, comments, requests, or other forms of participation in governance are purely advisory and non-binding upon the Council, Foundation, DAO or Community, unless and only to the extent: (i) the SIP has satisfied all required SIP governance procedures, formalities, and voting requirements for a final Community-approved Proposal; and (ii) the executable details of the SIP are published in a SIP implementation plan by at least a majority of the Council.  The Council, by supermajority decision, has the discretion to establish policies and procedures to complement or modify the Community-approved SIP procedures, including by appointing community stewards to effectuate administrative aspects of DAO governance and limiting the subject matter of SIPs that may be considered by the DAO.</p>\n<ol start=\"10\">\n<li>Council’s Participation in the SIP Process</li>\n</ol>\n<p>The Council, as extensions of the Community, may participate in the SIP process just like any other Community member, but also have certain additional responsibilities and privileges to ensure effective governance and the Community’s trust:</p>\n<p>A.\tThe Council must deliberate on and consider for sponsorship all formally compliant SIPs within a reasonable time frame after initial publication;<br>\nB.\tAll Council members’ may formally sponsor any Proposal, upon written notice to the Council and public, that has undergone a Community “temperature check” and that has otherwise appears to satisfy all conditions required for a final Community consensus vote. Council members may express conditions to their public sponsorship. Council members may not sponsor their own authored Proposals, or Proposals to which a Council member has a conflict of interest, unless the Proposal is also authored or sponsored by at least the remaining majority of Council members;<br>\nC.\tAt least one Sponsoring Council member should attend at least one Community town hall meeting to discuss the sponsored Proposal before it can be put up for a final Community consensus vote; and<br>\nD.\tThe Council shall not exercise undue or international delay in advancing Proposals along the Proposal life cycle.</p>\n<ol start=\"11\">\n<li>DAO Curation</li>\n</ol>\n<p>The Council must authenticate or otherwise authorize new Community-approved and Protocol-level Artists or curation nodes by executing a transaction from the DAO Multi-Sig, or from any other smart contract that may be established by the Council as provided herein. The Council has the discretion and authority to determine the method and manner by which the Community may approve new Artists or curation nodes. The Council, by supermajority decision, may also authenticate or otherwise authorize new Artists or curation nodes. The Council may delegate its administrative and curatorial authority under this section to third parties, committees, service providers, and committees.</p>\n<ol start=\"12\">\n<li>Approval of Certain Foundation Transactions</li>\n</ol>\n<p>A.\tThe following transactions by the Foundation require approval by at least a majority vote of the Council:<br>\na.\tAny transaction or series of connected transactions exceeding $100,000 USD per annum in value; and<br>\nb.\tAny transaction that otherwise would result in an actual or potential conflict of interest, meaning that a Council Member’s interest or concern competes with the interests of the Foundation.<br>\nB.\tAny transaction described in this Section must be the subject of an internal Council Proposal or an Async Proposal (in each case, a “Transaction Proposal”). A Foundation representative or a Council member may make a Transaction Proposal.<br>\nC.\tThe Foundation Director(s) may reject any Transaction or Proposal to the extent such Transaction or Proposal is not in compliance with the laws of the Cayman Islands or any other relevant jurisdiction or otherwise not in the best interest of the DAO.</p>\n<ol start=\"13\">\n<li>Independent Foundation Actions</li>\n</ol>\n<p>A.\tThe following transactions by the Foundation do not require approval by a majority vote of the Council (each an “Independent Foundation Action”, and collectively, the “Independent Foundation Actions”):<br>\na.\tAny De Minimis Transactions;<br>\nb.\tUtilizing a Foundation operating account for any approved or authorized purpose;<br>\nB.\tIn implementing Independent Foundation Actions, the Foundation and the Director(s), as applicable, are subject to the following requirements:<br>\na.\tThe Foundation and the Director(s) must comply with these By-Laws;<br>\nb.\tThe Director(s) must comply with their obligations as corporate fiduciaries of the Foundation; and<br>\nc.\tThe Foundation is required to provide the Council with a reasonable amount of notice prior to the implementation of an Independent Foundation Action.</p>\n<ol start=\"14\">\n<li>Member Code of Conduct</li>\n</ol>\n<p>A.\tCompliance with the Law.<br>\na.\tActing ethically and obeying the law, both in letter and spirit, are among the Foundation’s and the Council’s core values. Council members should understand the legal and regulatory requirements applicable to their area of responsibility, including federal, state, and foreign laws, as well as the relevant regulatory schemes (collectively, “Applicable Law”).<br>\nb.\tCouncil members should ask the Director(s) and/or their own legal counsel for advice when they are uncertain about Applicable Law or their duties or obligation as a Council member.<br>\nB.\tDiversity, Inclusion and Equity.<br>\na.\tThe Council strives to create a safe and welcoming environment for all would-be Community members, regardless of age, gender, ethnicity, religion, disability, sexual orientation, education, national origin, or any other differentiating factors. The Council is committed to maintaining an environment in which all individuals are treated with respect and dignity. The Council expects that all relationships among Council members will be free of unlawful bias, prejudice and harassment.<br>\nb.\tCouncil members are strictly forbidden from engaging in any type of discrimination, social harassment, demonstrations of hateful or offensive ideologies, or sexual harassment during Council business or in any Community-related setting outside of the Council.<br>\nC.\tIn evaluating Proposals and other issues affecting SuperRare, the Foundation, the DAO and the Community, Council members should focus on the substance of such discussions without criticizing individual members or engaging in personal attacks.<br>\nD.\tCouncil members should not use their role in a way that conflicts with the Council governing principles and the Foundation’s mission.<br>\nE.\tNo Council member should speak on behalf of the whole Council or carry themselves as a representative of the Council, unless explicitly authorized by all other Council members to do so. This provision does not in any way restrict a Council member from publicly discussing their personal opinion about a Proposal.</p>\n<ol start=\"15\">\n<li>Council Member Term</li>\n</ol>\n<p>Each individual Council member’s term shall last no more than two (2) calendar years (“Term”). The Council must schedule and effectuate a public Community election for replacement Council members to be completed before the expiration of any given Council members’ two year Term. There is no limit on the number of Terms an individual Council member may serve. The procedure and method for the public Council election or appointment of additional Council members to newly created Council seats shall be decided by majority Council decision for each election, unless otherwise provided for by a Community-approved SIP. By unanimous decision, the remaining Council may appoint a new Council member to a vacant Council seat by reason of the former Council member resigning or being removed from the Council.</p>\n<ol start=\"16\">\n<li>Accountability and Removal</li>\n</ol>\n<p>A.\tAny Council member that does not fulfill their duties or otherwise violates these By-Laws may be removed by any Community member in accordance with the SIP procedures, a unanimous Council decision, or any other subsequently adopted removal procedure;<br>\nB.\tCouncil members may initiate a removal of other Council members.<br>\na.\tAn action to remove a Council member (such member, a “Breaching Member”) for violation of these By-Laws or for any other reason, as determined by all of the other Council members, must be presented as a Proposal by a non-Breaching Member (a “Removal Proposal”) at a Council meeting.<br>\nb.\tA Removal Proposal will pass if it receives a unanimous vote of the non-Breaching Members.<br>\nc.\tIf the Removal Proposal passes, the Council may nominate or request the Community to nominate a replacement for the Breaching Member. An action to add a new Council member must be presented as a Proposal at a Regular Meeting (as defined below) (a “Replacement Proposal”).<br>\nd.\tA Replacement Proposal will pass if it receives at least a majority of votes of active Council members.<br>\ne.\tThe above voting mechanics are subject to the rules regarding Absent Members (as defined below) described below.<br>\nC.\tGiven that participation in the Council is public, a Breaching Member should also expect reputational damage.<br>\nD.\tThe interim absence of a Council member shall not preclude the satisfaction of any Quorum, voting, or DAO Multi-Sig requirements. Vacant Council seats shall be treated as a vote consistent with the present majority of voting Council members until the vacancy is relieved.</p>\n<ol start=\"17\">\n<li>Meetings<br>\nA.\tRegular Meetings. Regular meetings of Council members to be convened on a monthly basis (“Regular Meeting”) enable the Council to vote on Proposals and take any other acts within the Council’s authority as described herein.<br>\na.\tScheduling. The Council may convene Regular Meetings at its discretion, subject to a reasonable amount of notice to members. A Regular Meeting may take place via telephone, videoconference, or through a group chat application.<br>\nb.\tAttendees. Only Council members, their representatives, and the Director(s) of the Foundation will be permitted to attend Regular Meetings.<br>\ni.\t A quorum of a Regular Meeting consists of more than half of the Council members (“Quorum”). A Regular Meeting may not proceed without a Meeting Quorum.<br>\nii.\tA Council member may invite a third party to observe or participate in Council discussion or to take notes of the meeting, absent an objecting majority of the other Council members approving the third party’s attendance of such meeting (an “Authorized Third Party”). The Authorized Third Party must be bound by a non-disclosure agreement with the Foundation or with the Council member that invited the Authorized Third Party. The Authorized Third Party will not be counted towards the satisfaction of the Meeting Quorum.<br>\nc.\tProcedure<br>\ni.\tDiscussion Topics. Any Council member may raise an item for discussion among the Council members.<br>\nii.\tProposals</li>\n<li>Any Council member may make a Proposal.</li>\n<li>After a Council member makes a Proposal, the Council should discuss the Proposal, giving sufficient time for dissenting views. Council members should also describe any actual or potential conflicts of interest (as defined in The RareDAO Foundation Conflict of Interest Policy).</li>\n<li>After a discussion, the Council will vote on the Proposal according to the voting procedure described below.<br>\nd.\tMeeting Notes<br>\ni.\tThe Council will appoint a Council member or an Authorized Third Party to take notes of the Meeting (“Meeting Notes”).<br>\nii.\tMeeting Notes will conform to Chatham House rules.<br>\niii.\tMeeting Notes will exclude the following topics (each, a “Non-Public Item”), which may be discussed at Meetings from time to time:</li>\n<li>Individual financial or investment positions of Council members.</li>\n<li>Unremedied security vulnerabilities affecting the Protocol or other projects.</li>\n<li>Foundation activities that are subject to non-disclosure agreements with third parties.</li>\n<li>Compensation information of Foundation representatives.<br>\niv.\tSubject to a reasonable Council review and comment period chosen by the Council, Meeting Notes will be shared publicly with the Community.</li>\n</ol>\n<p>B.\tAdvisory Meetings. Advisory meetings enable the Council to discuss a specific subject matter among a smaller group of Council members or third parties (“Advisory Meetings”). The Council is not permitted to introduce or vote on Proposals at Advisory Meetings.<br>\na.\tThe same rules that apply to Regular Meetings will apply to Advisory Meetings, except that:<br>\ni.\tThere is no Meeting Quorum or other quorum requirement for an Advisory Meeting.<br>\nii.\tNo Council member may make or vote on a Proposal at an Advisory Meeting.<br>\niii.\tThe Council may or may not publish Meeting Notes from Advisory Meetings, at its discretion.</p>\n<p>C.\tEmergency Meetings. Emergency meetings enable the Council to rapidly respond to an Emergency, including but not limited to, an imminent security threat to the network, Protocol or Community (“Emergency Meetings”).<br>\na.\tThe same rules that apply to Regular Meetings will apply to Emergency Meetings, except that:<br>\ni.\tAn Emergency Meeting does not need to be convened with reasonable notice to Council members.<br>\nii.\tThere is no Meeting Quorum or other quorum requirement for an Emergency Meeting.<br>\niii.\tThe Council will not publish Meeting Notes from Emergency Meetings until the underlying security threat has been remedied or judged to no longer be a threat, in the Council’s sole discretion.</p>\n<ol start=\"18\">\n<li>\n<p>Controlling Authority<br>\nThese By-laws are subject to the provisions set forth in other sources of authority binding on the Foundation. In the event of any conflict between these By-laws and such authority enumerated herein, such authority shall supersede these By-laws and be controlling in the following order: (1) The Act, (2) The Foundation MOA and (3) The Foundation Articles.</p>\n</li>\n<li>\n<p>Voting Mechanics<br>\nUnless otherwise provided herein, Council members may provide approvals or rejections during a Meeting or in writing. Council members who are not present or responsive to an approval request shall be deemed a “no,” unless the unanimous approval of the Council is necessary to satisfy the approval request. In such a case, Council members must affirmatively vote for or  against a proposal and Council members who do not provide any response after fourteen (14) days of the approval request shall be deemed a “yes.”</p>\n</li>\n<li>\n<p>Amendments</p>\n</li>\n</ol>\n<p>These By-Laws may be amended through the SIP process or upon unanimous approval of the Council. Amendments made by the Council through unanimous decision must be publicly noticed to the DAO Community.</p>\n<h2>\n<a name=\"drawbacks-4\" class=\"anchor\" href=\"#drawbacks-4\"></a><strong>Drawbacks</strong>\n</h2>\n<p>Adherence to any specific or rigid rule set with authority granted at the Council level risks inflexible structure and tendencies towards centralization. The adoption of these Council By Laws &amp; Charter must be understood to be a temporary measure designed to incentivize the initial development of the Network.</p>\n<p><strong>Notice &amp; Disclaimer</strong>: My development and publication of these draft by-laws does not, and is not intended to, constitute legal advice or legal work product; instead, these draft by-laws are for independent consideration of the DAO Community, the DAO Council, and any other interested readers. I have prepared these draft By-Laws because of my intellectual interest in decentralizing the governance of SuperRare, as an informal and self proclaimed “steward” of the SuperRare community, and as an employee of SuperRare Labs Inc. DAO community members and Council members should contact their respective attorneys to aid in the interpretation and understanding of these by laws and, of course, to suggest edits. The content on this posting is provided “as is;” no representations are made that the content is error-free or infallible.</p>","url":"https://forum.rare.xyz/t/sip-adopt-dao-council-by-laws/703","status":"meta_governance"},{"id":623,"t":"SIP | Improving $RARE Stability","d":"2022-03-24T02:40:05.288Z","c":"<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Author</th>\n<th>Emilio Cazares</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Status</td>\n<td>Implemented</td>\n</tr>\n<tr>\n<td>Type</td>\n<td>Treasury Management</td>\n</tr>\n<tr>\n<td>Implementor</td>\n<td>DAO Council</td>\n</tr>\n<tr>\n<td>Sponsor(s)</td>\n<td>Nick Tomaino</td>\n</tr>\n<tr>\n<td>Temperature Check Poll</td>\n<td><a href=\"https://discord.com/channels/666318003972997136/939274552251412630/956550291422072832\">LINK</a></td>\n</tr>\n<tr>\n<td>Created Date</td>\n<td>03/23/2022</td>\n</tr>\n</tbody>\n</table>\n</div><h2>\n<a name=\"summary-1\" class=\"anchor\" href=\"#summary-1\"></a>Summary</h2>\n<p>Allocate $RARE from the treasury to engage market makers and liquidity providers to improve liquidity and price stability</p>\n<h2>\n<a name=\"motivation-2\" class=\"anchor\" href=\"#motivation-2\"></a>Motivation</h2>\n<p>Currently, the only $RARE tokens in circulation are the ~150,000,000 tokens originally made available to the Artists and Collectors who made SuperRare what it is today. Market making buttresses efficient markets, reduces vulnerability to price swings, and in the case of $RARE – increases opportunities for potential buyers seeking to leverage the utility of of the worlds finest curation token. Some market making measures involving increased $RARE circulation are important for ensuring stable and healthy markets, but not without responsible process and transparent decision making situating the community at the helm.</p>\n<h2>\n<a name=\"abstract-3\" class=\"anchor\" href=\"#abstract-3\"></a>Abstract</h2>\n<p>This SIP contemplates several methods to improve $RARE liquidity and acts as an ongoing request for comment from the $RARE community to suggest market making measures to improve $RARE liquidity. In the interest of efficiency, this Proposal seeks to establish the Council’s independent authority to enter into transactions with third party market makers and/or liquidity providers subject to procedural and transparency obligations. In the spirit of decentralization, this proposal also acts as a call to the community to suggest more user oriented, trustless forms of liquidity provision.</p>\n<h2>\n<a name=\"specification-4\" class=\"anchor\" href=\"#specification-4\"></a>Specification</h2>\n<p>Up to 30,000,000 $RARE (or equivalent value in ETH or USDC) may be made available over the one (1) year period following the approval of this Proposal for certain liquidity and market making activities designed to improve liquidity for $RARE as identified below.</p>\n<h3>\n<a name=\"approved-methods-of-providing-liquidity-5\" class=\"anchor\" href=\"#approved-methods-of-providing-liquidity-5\"></a>Approved Methods of Providing Liquidity</h3>\n<ol>\n<li>Loan Agreements (including purchase options) with Council-Approved Market Makers</li>\n<li>Discounted Purchase of $RARE to Council-Approved Market Makers</li>\n<li>Incentivized Liquidity Mining Program</li>\n<li>Direct Provision of Liquidity from DAO Treasury</li>\n</ol>\n<h3>\n<a name=\"procedure-for-council-approving-transactions-related-to-this-proposal-6\" class=\"anchor\" href=\"#procedure-for-council-approving-transactions-related-to-this-proposal-6\"></a>Procedure for Council Approving Transactions Related to this Proposal</h3>\n<p>The Council may only enter into, execute, and deploy a subsequent transaction or program fulfilling this Proposal’s purpose and relating to an approved method of providing liquidity if the following conditions are met:</p>\n<ol>\n<li>the transaction is approved by an informed consent from a majority of Council;</li>\n<li>the transaction is approved by independent legal counsel; and</li>\n<li>the Council provides at least fourteen (14) days public notice before each DAO Treasury transaction performed within the scope of this Proposal</li>\n</ol>\n<p>Any unused $RARE upon the expiry of this Proposal shall be immediately relinquished back to the DAO Treasury. Nothing in this Proposal should serve as an ongoing basis of authority for the Council to use DAO Treasury funds for market making activities after this Proposal’s expiration.</p>\n<h3>\n<a name=\"requests-for-proposals-7\" class=\"anchor\" href=\"#requests-for-proposals-7\"></a>Requests for Proposals</h3>\n<p>Up to 5,000,000 additional $RARE shall be set aside for the Council to dedicate to community-originated liquidity improvement proposals passed through the SuperRare Improvement Proposal (”SIP”) procedures. The passage of this Proposal would serve as a request for any community member to propose any program or transaction fulfilling this Proposal’s goals. Such community-originated Proposals must survive the ordinary SIP requirements to qualify for $RARE designated by this Proposal for market making activities. The Council may use any portion of the dedicated funds to incentivize related proposal development.</p>\n<h2>\n<a name=\"benefits-8\" class=\"anchor\" href=\"#benefits-8\"></a><strong>Benefits</strong>\n</h2>\n<p>Improved liquidity, the potential to further decentralize $RARE holdings, and greater access to the $RARE ecosystem. Establishing a regulatory and community friendly precedent for coordinating market making decisions at the community level.</p>\n<h2>\n<a name=\"drawbacks-9\" class=\"anchor\" href=\"#drawbacks-9\"></a><strong>Drawbacks</strong>\n</h2>\n<p>Regulatory risks associated with market making activities and unpredictable governance/market outcomes associated with increasing the circulating $RARE supply. Empowering the Council to make decisions approved by the DAO pursuant to this Proposal enables flexibility and quick decision making but potentially increases information asymmetries between the Council and Community, which creates certain insider trading or securities risks.  Such informational asymmetries should be mitigated as provided in this Proposal, or as otherwise deemed appropriate by the Community or Council.</p>\n<h2>\n<a name=\"outcomes-10\" class=\"anchor\" href=\"#outcomes-10\"></a>Outcomes</h2>\n<p>This Proposal will be deemed a success if the Council is able to successfully enter into market making transactions (or implement community-generated and approved proposals) while observing the transparency and notice obligations defined herein. Accordingly, the Council should attempt to disclose material aspects of transactions entered into pursuant to this Proposal to the extent such disclosure doesn’t violate any duties of confidentiality. In order to reduce information asymmetries, the Council should make its best efforts to provide early notice and details about the anticipated aggregate sum of $RARE to be released into the market. The Council should consider nominating or otherwise deferring to community members who can provide technical insights on $RARE markets routinely after market making transactions made pursuant to this Proposal.</p>","url":"https://forum.rare.xyz/t/sip-improving-rare-stability/623","status":"treasury-management"},{"id":693,"t":"SIP | I'll Take the Omakase","d":"2022-04-26T05:39:27.960Z","c":"<ul>\n<li>Author: <strong>Kyle Olney, Director of Product @ SuperRare Labs</strong>\n</li>\n<li>Status: <strong>Passed</strong>\n</li>\n<li>Type: <strong>Governance | Curation</strong>\n</li>\n<li>Implementer: <strong>SuperRare Labs</strong>\n</li>\n<li>Sponsor(s): Pindar Van Arman</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/939274552251412630/968511818370781256\">Discord</a>\n</li>\n<li>Created Date: <strong>04/25/22</strong>\n</li>\n</ul>\n<p><strong>Summary:</strong> Allow SuperRare Labs to select 1x space operator per month as needed for strategic business development to benefit the network</p>\n<p><strong>Abstract:</strong> The current rules of the Space Race, which require Space Operators to compete in a public contest determined exclusively by the $RARE token holder community, prevent SuperRare from engaging in strategic business development that could benefit the Network. This proposal would allow SuperRare Labs the authority to add 1x Space operator each month, subject to final approval by the DAO Governance Council, so that strategic and/or time-sensitive business opportunities can be captured for the benefit of all network stakeholders.</p>\n<p><strong>Motivation:</strong> SuperRare Labs, as the curation team that helped pioneer and define standards for the cryptoart industry, is regularly presented with opportunities that would benefit the growth, reach, profitability and prestige of SuperRare Network. The need to adhere to strict rules around the decentralized governance of Spaces has begun to interfere with SuperRare Labs’ ability to directly onboard premier curators to the DAO, which would have obvious business value were SuperRare Labs still able to execute business development decisions unilaterally.</p>\n<p>SuperRare Labs has also received interest from multiple world-class curatorial teams who’s brand prestige + operational requirements make publishing business plans and uncertainty around a successful public campaign non-starters for the normal Space Race selection process.</p>\n<p>Allowing SuperRare Labs the opportunity to select 1x Space for onboarding each month - with confirmation from the Governance Council - would increase both the number of world class curators and partnerships that can be leveraged to enhance the reach &amp; prestige of SuperRare Network.</p>\n<p><strong>Specification</strong>:</p>\n<ul>\n<li>The DAO Governance Council may register up to one (1) Space Operator requested by SuperRare Labs’ curation team per calendar month</li>\n<li>The Space Operator requested by SuperRare Labs may be registered by the Council in addition to as many as ten (10) community-approved Space Operators that the Council is already authorized to register per month (<em>See</em> SIP \"<a href=\"https://snapshot.org/#/superraredao.eth/proposal/0xc9fa170547b53f870e12127440603b6f67bab905653b99735d869cd3fcfbb40f\">Establish Proposed Space Race Curation Parameters</a>”)</li>\n<li>SuperRare Labs must publicly notify the DAO about each requested Space Operator under this proposal</li>\n<li>The Council will have discretion to approve or deny SuperRare Labs’ request by a public majority decision occurring no sooner than seven (7) days after SuperRare Labs’ public request</li>\n<li>Every registered Space Operator, as of the date of each public request by SuperRare Labs, may publicly object to the registration of an additional Space Operator under this Proposal within the seven (7) day period following each public request. The Council shall not register any requested Space Operator that is affirmatively and publicly objected to by a supermajority (&gt;75%) of registered Space Operators</li>\n<li>If passed, this change will be effective beginning the calendar month in which it was proposed</li>\n<li>Unused requests will roll over to subsequent months if not utilized within the original month of allotment and will be valid until the expiration of this Proposal</li>\n<li>This proposal, and the accompanying authority granted to the Council, shall expire after 12 months.</li>\n</ul>\n<p><strong>Benefits</strong>. The Council’s case-by-case deference to SuperRare Labs’ curation team will result in the addition of more high quality, prestigious curators joining the network as Space Operators.</p>\n<p><strong>Drawbacks:</strong> The primary drawback to this proposal is that it allows SuperRare Labs expanded authority over the selection of Space Operators instead of the community maintaining 100% control.</p>\n<p><strong>Outcomes</strong>:. This effect of this proposal is relatively easy to monitor, as the public will have notice of all new Space operators onboarded pursuant to this proposal. In any case, this proposal is limited to twelve (12) months. Moreover, the DAO community may submit a proposal to unwind the effect of this proposal at any time.</p>","url":"https://forum.rare.xyz/t/sip-ill-take-the-omakase/693","status":"space-race"},{"id":878,"t":"SIP | Variety is the Spice of Life","d":"2022-07-20T08:06:49.437Z","c":"<ul>\n<li>Author: <strong>Kyle Olney (COO), Jonathan Perkins (CPO), Tom Wu (VP Finance), John Crain (CEO) @ SuperRare Labs</strong>\n</li>\n<li>Status: <strong>Approved</strong>\n</li>\n<li>Type: <strong>Governance</strong>\n</li>\n<li>Implementer: <strong>Governance Council</strong>\n</li>\n<li>Sponsor(s): Serena Tabacchi; John Crain</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/939274552251412630/1001901502924857424\" class=\"inline-onebox\">Discord</a>\n</li>\n<li>Created Date: <strong>07/20/22</strong>\n</li>\n</ul>\n<h2>\n<a name=\"summary-1\" class=\"anchor\" href=\"#summary-1\"></a><strong>Summary</strong>\n</h2>\n<p>Provide authorization to diversify balance sheet assets held by the DAO Treasury such that stable forms of payment (USDC/DAI) can be utilized on a regular and ongoing basis as working capital in lieu of relying strictly on retained crypto assets.</p>\n<h2>\n<a name=\"abstract-2\" class=\"anchor\" href=\"#abstract-2\"></a><strong>Abstract</strong>\n</h2>\n<p>The current <a href=\"https://etherscan.io/address/0x860a80d33e85e97888f1f0c75c6e5bbd60b48da9\">DAO Treasury</a> is comprised of +6,000 ETH, and 400,000,000 $RARE tokens (as of July 20, 2022 - the value of the Treasury is approximately USD <a href=\"https://deepdao.io/organization/59b3cb22-a5a2-4aaa-b7fb-360baa910666/organization_data/finance\">$118M</a>, comprised of $109M in $RARE and $9.5M in ETH). This SIP proposes that up to 20% of the DAO treasury’s assets be earmarked for the purpose of executing any token swaps, direct placements, or sales deemed strategically valuable, prudent or necessary to: i.) diversify assets held by the DAO treasury on a regular basis, and ii.) establish necessary stable reserves that can be utilized to pay for ongoing operational expenses of the DAO.</p>\n<h2>\n<a name=\"motivation-3\" class=\"anchor\" href=\"#motivation-3\"></a><strong>Motivation</strong>\n</h2>\n<p>As we look to scale the breadth and depth of the DAO’s activities, building a reserve of USDC/DAI that can be utilized to pay for real-world operating expenses has become an increasingly large concern as there is no native cashflow in USDC/DAI feeding the treasury today and there is no established authorization for swapping retained assets like ETH or $RARE to cash on an as-needed basis. Establishing this authority is even more important now than ever due to persistent macro-volatility affecting the treasury so far this year.</p>\n<p>Over the last year since launching the DAO many network participants have also been approached by private parties interested in acquiring $RARE in blocks too large to be facilitated by the thin order books maintained at most exchanges today.</p>\n<h2>\n<a name=\"specification-4\" class=\"anchor\" href=\"#specification-4\"></a><strong>Specification</strong>\n</h2>\n<p>Upon approval of this SIP, the RareDAO Foundation at the direction of the Governance Council will be authorized to swap up to 20% of accumulated treasury assets to USDC/DAI, at their discretion, as needed to maintain safe reserves of working capital &amp; take advantage of favorable conversion rates as they present themselves in the future. Furthermore, up to 20% of all future revenue earned by the DAO may be swapped into stablecoins as provided by this Proposal.</p>\n<p>The Foundation / Governance Council will periodically earmark the necessary funds which will serve as collateral for any swaps, direct placements or public sales it deems necessary and prudent to establish the appropriate stablecoin reserves. The Foundation / Governance Council shall have the discretion to engage reputable agency desks and to otherwise take any action needed to diversify the DAO treasury as provided under this proposal, including the offering of reasonable discounts for bulk purchases of $RARE.</p>\n<p>To the extent practical, any swaps or private placements of $RARE or ETH under this proposal - once complete - will include a public notice to the DAO detailing each transaction, which may include the details of any lockup provisions specifying the holding terms for the relevant acquirer (e.g. up to 1yr), subject to the discretion of the Governance Council.</p>\n<h2>\n<a name=\"benefits-5\" class=\"anchor\" href=\"#benefits-5\"></a><strong>Benefits</strong>\n</h2>\n<p>Providing authorization to swap retained treasury assets for cash assets during periods of favorable market conditions reflects the desire for prudent financial management and allows the DAO as a whole to de-risk the cost of holding &amp; receiving the majority of its cashflows in volatile crypto-assets.</p>\n<p>In light of prevailing market conditions, converting a reasonable percentage of the treasury’s assets to stablecoins will provide: i.) increased certainty around the financing of ongoing operations, and ii.) further margin of safety given that the financial landscape may remain challenging for a prolonged time period.</p>\n<h2>\n<a name=\"drawbacks-6\" class=\"anchor\" href=\"#drawbacks-6\"></a><strong>Drawbacks</strong>\n</h2>\n<p>Any treasury assets allocated to diversification and converted to stablecoins will no longer be eligible for use in their native unit (e.g. RARE/ETH), and to the extent that such conversions occur at a price different to their cost basis (FIFO) there will be taxable gains/losses that need to be recognized.</p>\n<h2>\n<a name=\"outcomes-7\" class=\"anchor\" href=\"#outcomes-7\"></a><strong>Outcomes</strong>\n</h2>\n<p>If successful, the DAO treasury will diversify away from a 100% holding of RARE/ETH and begin holding a meaningful percentage of its total assets in USDC/DAI on a regular basis.</p>","url":"https://forum.rare.xyz/t/sip-variety-is-the-spice-of-life/878","status":"treasury-management"},{"id":781,"t":"SIP | Donating commission from the Madonna x Beeple Mother of Creation auction to non-profit organizations","d":"2022-05-11T17:48:03.706Z","c":"<ul>\n<li>Author: Maaria Bajwa</li>\n<li>Status: Sponsored | Consensus Passed</li>\n<li>Type: Governance</li>\n<li>Implementer: SuperRare DAO</li>\n<li>Sponsor(s): John Crain</li>\n<li>Link to Temperature Check Poll: TBD</li>\n<li>Created Date: 05/11/2022</li>\n</ul>\n<p><strong>Summary</strong><br>\nThe SuperRare DAO should donate the 55.638Ξ ETH earned as a commission from the auction of the 3 NFTs in <a href=\"https://superrare.com/series/0x28b19a2885b68613d89c4e38eaf5cf3849978d70\" rel=\"noopener nofollow ugc\">Mother of Creation</a> triptych to three nonprofits: <a href=\"https://voices.org.ua/en/\" rel=\"noopener nofollow ugc\">The Voices of Children</a>, <a href=\"https://cityofjoycongo.org/about-city-of-joy/\" rel=\"noopener nofollow ugc\">The City of Joy</a>, and <a href=\"https://www.nationalbailout.org/history\" rel=\"noopener nofollow ugc\">Black Mama’s Bail Out</a>.</p>\n<p><strong>Abstract</strong><br>\nMother of Nature is an NFT collaboration between Madonna and Beeple, two of the most influential creators of all time. The triptych centers around the idea of creation and motherhood, and each of the three works in the collection represents a different form of birth in contemporary life. The 3 NFTs in the collection were offered for sale in a 48-hour auction on SuperRare starting Wednesday, May 11th.</p>\n<p>Proceeds from the sale will benefit three nonprofit organizations picked by Madonna and Beeple to further their missions of supporting mothers across the globe:</p>\n<ol>\n<li>The Voices of Children - supports women and children affected by the war in Ukraine with psychological and urgent care.</li>\n<li>The City of Joy - a community that helps survivors of sexual and physical violence heal and rebuild their lives with new skills. Based in Democratic Republic of Congo, the organization has seen 1,734 women graduate their program since opening its doors in 2011.</li>\n<li>Black Mama’s Bail Out - provides bail and support for black caregivers who are disproportionately incarcerated while awaiting trial. These caregivers have not been convicted of crimes and have children, families, and communities that rely on them.</li>\n</ol>\n<p>The artists are donating all primary and secondary proceeds from the Mother of Creation collection to these three charities. In total, the 3 pieces sold for 309.1Ξ total.</p>\n<p>The SuperRare DAO earned 55.638Ξ from the auction – 15% commission + the 3% marketplace fee from the initial sale.</p>\n<p>This proposal asks that the DAO donate 55.638Ξ earned from the initial sale to the 3 charities listed above via Madonna’s Ray of Light Foundation, which will oversee the operational distribution of funds to the underlying charities. Donations will be made in cryptocurrency when possible.</p>\n<p>A breakdown of the commission sent to the SuperRare DAO Treasury from the sales is below:</p>\n<ul>\n<li>Token ID [1] → 12.969Ξ (<a href=\"https://etherscan.io/tx/0x6af36b0130b34fdcb7f7d1da95db78f0d994eb9577bbb355fad99d6b7af0d66d\" rel=\"noopener nofollow ugc\">etherscan</a>)</li>\n<li>Token ID [2] → 30.69Ξ (<a href=\"https://etherscan.io/tx/0xeab066b1b1a503917d1635e0d81fa15741b07218c0c6b0a20d1a94e2ff05df22\" rel=\"noopener nofollow ugc\">etherscan</a>)</li>\n<li>Token ID [3] → 11.979Ξ (<a href=\"https://etherscan.io/tx/0x32181e8f5f7dc7ca721738e0169b98babdc105e2b36da67dcc02638781462911\" rel=\"noopener nofollow ugc\">etherscan</a>)</li>\n</ul>\n<p>This proposal looks to donate 55.638Ξ from the SuperRare DAO treasury to the three charities listed above via Madonna’s Ray of Light Foundation, which will oversee the operational distribution of funds to the underlying charities. Donations will be made in cryptocurrency when possible.</p>\n<p><strong>Motivation</strong><br>\nAfter a year-long creative journey to birth these pieces of art, two of the most influential artists of all-time have chosen SuperRare as their launch partner. This is an opportunity for SuperRare DAO to show its support for artists and creators by aligning with their missions.</p>\n<p><strong>Specification</strong><br>\nTransfer 55.638Ξ to the Ray of Light Foundation at (0x90a72ED643889DE34B86976ce492f4b2dA712563). The Ray of Light Foundation will manage the logistics of distributing the funds to the three organizations. Each of the non-profits agrees to highlight SuperRare DAO as a donor, and will provide a way for SuperRare DAO members to stay up to date on their efforts via email or text updates. At this time, it would be too operationally cumbersome for the non-profits to provide detailed information on the use-of-proceeds for SuperRare DAO’s specific donation.</p>\n<p>Use the links below to sign up for updated from the nonprofits:</p>\n<ul>\n<li><a href=\"https://cityofjoycongo.org/subscribe\" rel=\"noopener nofollow ugc\">City of Joy</a></li>\n<li><a href=\"http://eepurl.com/dtLmmf\" rel=\"noopener nofollow ugc\">Black Mama’s Bail Out</a></li>\n<li>\n<a href=\"https://voices.org.ua/en/\" rel=\"noopener nofollow ugc\">Voices of Children</a> (sign up link at bottom of page)</li>\n</ul>\n<p><strong>Benefits</strong><br>\nThe long-term benefits to donating the primary and secondary commissions to charity outweigh the short-term financial impact to the DAO treasury, regardless of the auction results. This includes:</p>\n<p>• Ensuring that high-profile drops that drive visibility to SuperRare continue to occur on the platform.<br>\n• Clearly aligning SuperRare DAO with artists and creators who want to use their art and creativity to do good.<br>\n• The SuperRare DAO is currently the only party taking a commission from the sale. All other parties, including the artists, creators, and technology partners have agreed to waive their fees in order to maximize the amount given to the non-profit organizations. It is technically too cumbersome for SuperRare DAO to donate marketplace fees, however, I strongly encourage SuperRare DAO to consider figuring out how to do this for the future. If SuperRare DAO is the only participant to take a commission, other artists may consider releasing their NFTs on other platforms that are more aligned with their missions.</p>\n<p><strong>Drawbacks</strong><br>\nThe SuperRare DAO community treasury will need to use the 18% commission earned from the auction.</p>\n<p><strong>Outcomes</strong><br>\nThis proposal hopes to align SuperRare DAO with artists and creators who are using their art to make a positive impact, especially those who have broad reach.</p>\n<p><strong>Vote</strong><br>\nYes - Donate 55.638Ξ to the 3 charities mentioned above.<br>\nNo - Do not donate.</p>\n<p><strong>AUTHOR UPDATE:</strong><br>\n[I have updated the proposal to remove references to the SuperRare DAO donating proceeds from secondary sales to charity, as this does not seem like a viable option at this time. Instead the proposal has been updated to reference the 55.638Ξ the SuperRare DAO treasury received from the initial sale.]</p>","url":"https://forum.rare.xyz/t/sip-donating-commission-from-the-madonna-x-beeple-mother-of-creation-auction-to-non-profit-organizations/781","status":"treasury-management"},{"id":480,"t":"SIP | We Like the $RARE","d":"2022-02-04T20:45:55.019Z","c":"<p><strong>Title:</strong> We Like the $RARE</p>\n<ul>\n<li>Author: <strong>Kyle Olney, Director of Product @ SuperRare Labs</strong>\n</li>\n<li>Status: <strong>Temperature Check</strong>\n</li>\n<li>Type: <strong>Governance</strong>\n</li>\n<li>Implementer: <strong>SuperRare Labs</strong>\n</li>\n<li>Sponsor(s): John Crain</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/868174870389878865/939264286449102950\" class=\"inline-onebox\">Discord</a>\n</li>\n<li>Created Date: <strong>02/04/22</strong>\n</li>\n</ul>\n<p><strong>Summary:</strong> Waive network fees for platform transactions paid in $RARE</p>\n<p><strong>Abstract:</strong> With the passage of the Shut Up and Take My $RARE SIP, users would be able to purchase artworks on SuperRare using $RARE as a payment mechanism. This SIP proposes to waive network fees for any transaction paid in $RARE, creating further utility for its continued circulation and use in our ecosystem.</p>\n<p><strong>Motivation:</strong> As we expect an increasing number of $RARE tokens to be distributed through a variety of token distribution programs in 2022, SuperRare Labs would like to create as much utility for $RARE token holders as possible.</p>\n<p>One of the most obvious benefits that can be provided to $RARE holders who transact on SuperRare is to waive the 3% network transaction fee for any purchase executed using $RARE. By waiving these fees, we create an incentive for $RARE to become the primary payment instrument in our marketplace, as well as increase the velocity of tokens in circulation - both in aggregate, and more specifically into the hands of those artists/collectors who are most active on the platform.</p>\n<p><strong>Specification:</strong> If passed SuperRare Labs will deploy two minor changes necessary to update the marketplace and auction-house smart contracts such that network transaction fees will be voided for payments made in $RARE.</p>\n<p><strong>Benefits:</strong> Similar to the Shut Up and Take My $RARE SIP, this change benefits the network in multiple ways by i.) increasing utility of the $RARE token, and ii.) promoting further distribution of governance tokens to artists/collectors who are active participants in the network, while boosting token velocity and providing additional reasons to accumulate $RARE.</p>\n<p>A further benefit of this program is that it creates an organic “demand” signal in the market to help offset the “supply” signal of increasing token distribution from the DAO treasury - which should help stabilize price discovery.</p>\n<p><strong>Drawbacks:</strong> The sole drawback to implementing this proposal would be lost revenue that would otherwise accrue to the DAO treasury by continuing to maintain the 3% network transaction fee.</p>\n<p>This loss of network fee revenue will require require that collector royalties on qualifying transactions executed in $RARE be paid out utilizing existing assets held by the DAO treasury (either ETH, or potentially $RARE).</p>\n<p><strong>Outcomes:</strong> Once implemented, $RARE-based transactions on SuperRare will no longer be assessed the 3% network transaction fee.</p>\n<p>Further impacts to marketplace health are hard to ascertain at this stage and may justify the inclusion of a sunset provision so the DAO can check-point whether the cost of this program outweighs it’s expected benefits before making this change permanent.</p>","url":"https://forum.rare.xyz/t/sip-we-like-the-rare/480","status":"treasury-management"},{"id":479,"t":"SIP | Shut up and take my $RARE","d":"2022-02-04T20:35:54.224Z","c":"<p><strong>Title:</strong> Shut up and take my $RARE</p>\n<ul>\n<li>Author: <strong>Kyle Olney, Director of Product @ SuperRare Labs</strong>\n</li>\n<li>Status: <strong>Implemented</strong>\n</li>\n<li>Type: <strong>Governance</strong>\n</li>\n<li>Implementer: <strong>SuperRare Labs</strong>\n</li>\n<li>Sponsor(s): <a class=\"mention\" href=\"/u/ntomaino\">@ntomaino</a> <a class=\"mention\" href=\"/u/vanarman\">@VanArman</a>\n</li>\n<li>Link to Temperature Check Poll: <a href=\"https://discord.com/channels/666318003972997136/868174870389878865/939263991224623154\" class=\"inline-onebox\">Discord</a>\n</li>\n<li>Created Date: <strong>02/04/22</strong>\n</li>\n</ul>\n<p><strong>Summary:</strong> Upgrade SuperRare network payment methods to include $RARE, DAI, and USDC</p>\n<p><strong>Abstract:</strong> With the launch of Spaces, SuperRare’s new “Bazaar” marketplace contract will include native support for arbitrary payment in any token adhering to the ERC-20 standard. This SIP proposes to update the master token registry of acceptable payment instruments on SuperRare network to include our native curation token, as well as two industry-leading stable-coins.</p>\n<p><strong>Motivation:</strong> Many artists and collectors who received $RARE tokens following the <span class=\"hashtag\">#RAREDrop</span> in August '21 have requested the ability to either i.) accept payment for their artwork in $RARE, or ii.) make payments to acquire artworks using $RARE. Creating more utility for the $RARE token inside the SuperRare ecosystem is clearly in the best interests of the network, and would further support the goal of distributing governance tokens into the hands of a wider number of engaged/contributing community members - including those who have joined as Artists since last summer.</p>\n<p><strong>Specification:</strong> Utilizing the ERC-20 support functions of the new Spaces/Bazaar marketplace contract, the SuperRare Governance Council will update the payment methods registry to facilitate settlement of trades in $RARE, DAI, USDC, WETH and ETH. While the new smart contract supports this functionality natively, the visual design + front-end updates necessary to support this change in the application interface will need to be prioritized and scheduled by SuperRare Labs following successful passage of this SIP.</p>\n<p><strong>Benefits:</strong> Accepting payment in $RARE benefits the network in multiple ways by: i.) increasing utility of the $RARE token, ii.) distributing governance tokens to artists who are currently active participants in the network, iii.) allowing artists to be paid in stable-coins which are significantly less volatile than native cryptocurrency assets, iv.) organically diversifying revenue streams that feed into the community treasury, and v.) expanding the potential market reach for SuperRare by allowing holders of non-ETH crypto assets to transact more frictionlessly on the platform.</p>\n<p><strong>Drawbacks:</strong> The primary drawbacks to accepting $RARE / DAI / USDC are related to the cost of implementation from a design and engineering perspective. Interfaces will need to be redesigned to accommodate multiple payment methods, an increased number of front-end artifacts and APIs will be required, administration and accounting overhead for the community treasury will be marginally increased, and supporting the pricing of artworks in multiple currency instruments at a stable exchange rate may require the integration of an oracle / third-party pricing API which would be chosen at the discretion of SuperRare Labs.</p>\n<p>Accepting USDC in particular would introduce counter-party risk, as this token is technically a “permissioned” asset maintained by a centralized, US-regulated counter-party (though it is still arguably among the highest quality non-bearer stable-coins in the industry). DAI on the other hand, is a permissionless stable-coin that carries no counter-party risks beyond the possibility of a normal smart contract exploit being discovered.</p>\n<p><strong>Outcomes:</strong> Once fully implemented, transactions on SuperRare will be able to be completed using $RARE, DAI, USDC, and WETH in addition to ETH. The community treasury will also begin holding multiple reserve assets on its balance sheet.</p>","url":"https://forum.rare.xyz/t/sip-shut-up-and-take-my-rare/479","status":"protocol-development, rare"}],"timestamp":"2025-03-01T05:17:36.414Z","category":"Governance Proposals","categoryId":18,"totalPages":2}